Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/writing-code/robotbuilder-drive-tank.po
Languages: es_mx

source: Driving the Robot with Tank Drive and Joysticks
es_mx: Manejando el Robot con Modo Tanque y Controles

source: A common use case is to have a joystick that should drive some actuators that are part of a subsystem. The problem is that the joystick is created in the RobotContainer class and the motors to be controlled are in the subsystem. The idea is to create a command that, when scheduled, reads input from the joystick and calls a method that is created on the subsystem that drives the motors.
es_mx: Un caso de uso común es tener un joystick que debería controlar algunos actuadores que forman parte de un subsistema. El problema es que el joystick se crea en la clase RobotContainer y los motores a controlar están en el subsistema. La idea es crear un comando que, cuando esté programado, lea la entrada del joystick y llame a un método que se crea en el subsistema que impulsa los motores.

source: In this example a drive base subsystem is shown that is operated in tank drive using a pair of joysticks.
es_mx: En este ejemplo se muestra un subsistema de base de conducción que funciona en la conducción de un tanque usando un par de controles.

source: Create a Drive Train Subsystem
es_mx: Crear un Subsistema del Chasis

source: Create a subsystem called Drive Train. Its responsibility will be to handle the driving for the robot base.
es_mx: Cree un subsistema llamado Drive Train. Su responsabilidad será manejar la conducción de la base del robot.

source: Inside the Drive Train create a Differential Drive object for a two motor drive. There is a left motor and right motor as part of the Differential Drive class.
es_mx: Dentro del tren de transmisión/Drive Train, cree un objeto de transmisión diferencial para una transmisión de dos motores. Hay un motor izquierdo y un motor derecho como parte de la clase Differential Drive de transmisión diferencial.

source: Since we want to use more then two motors to drive the robot, inside the Differential Drive, create two Speed Controller Groups. These will group multiple speed controllers so they can be used with Differential Drive.
es_mx: Dado que queremos usar más de dos motores para impulsar el robot, dentro del diferencial, cree dos grupos de controladores de velocidad. Estos agruparán varios controladores de velocidad para que se puedan utilizar con la transmisión diferencial.

source: Finally, create two Speed Controllers in each Speed Controller Group.
es_mx: Finalmente, cree dos controladores de velocidad en cada grupo de controladores de velocidad.

source: Add the Joysticks to the Operator Interface
es_mx: Agregar los controles a la Interfaz Operadora

source: Add two joysticks to the Operator Interface, one is the left stick and the other is the right stick. The y-axis on the two joysticks are used to drive the robots left and right sides.
es_mx: Agregar dos controles a la Interfaz Operadora, uno es la palanca izquierda y el otro es la palanca derecha. El eje Y de los dos controles se usa para manejar los robots a la izquierda y a la derecha.

source: Be sure to export your program to C++ or Java before continuing to the next step.
es_mx: Asegúrese de exportar su programa a C++ o Java antes de continuar con el siguiente paso.

source: Create a Method to Write the Motors on the Subsystem
es_mx: Crear un método para escribir los motores en el subsistema

source: Create a method that takes the joystick inputs, in this case the the left and right driver joystick. The values are passed to the RobotDrive object that in turn does tank steering using the joystick values. Also create a method called stop() that stops the robot from driving, this might come in handy later.
es_mx: Crear un método que tome las entradas del control, en este caso el control del conductor izquierda y derecha. Los valores se pasan al objeto RobotDrive que a su vez hace la dirección del tanque usando los valores de la palanca. También cree un método llamado stop() que impida que el robot conduzca, esto podría ser útil más adelante.

source: Some RobotBuilder output has been removed for this example for clarity
es_mx: Se ha eliminado parte de la salida de RobotBuilder para este ejemplo para mayor claridad

source: Read Joystick Values and Call the Subsystem Methods
es_mx: Leer los valores de las palancas y llamar los métodos del subsistema

source: Create a command, in this case called Tank Drive. Its purpose will be to read the joystick values and send them to the Drive Base subsystem. Notice that this command Requires the Drive Train subsystem. This will cause it to stop running whenever anything else tries to use the Drive Train.
es_mx: Cree un comando, en este caso llamado Tank Drive. Su propósito será leer los valores del joystick y enviarlos al subsistema Drive Base. Tenga en cuenta que este comando requiere el subsistema Drive Train. Esto hará que deje de funcionar cada vez que cualquier otra cosa intente utilizar el tren de transmisión.

source: Add the Code to do the Driving
es_mx: Añada el Código para hacer la conducción

source: Add code to the execute method to do the actual driving. All that is needed is to get the Joystick objects for the left and right drive joysticks and pass them to the Drive Train subsystem. The subsystem just uses them for the tank steering method on its RobotDrive object. And we get tank steering.
es_mx: Añada el código al método de ejecución para hacer la conducción real. Todo lo que se necesita es conseguir los objetos de las palancas de conducción izquierda y derecha y pasarlos al subsistema Drive Train. El subsistema sólo los usa para el método de dirección del tanque en su objeto RobotDrive. Y obtenemos la dirección del tanque.

source: We also filled in the ``end()`` method so that when this command is interrupted or stopped, the motors will be stopped as a safety precaution.
es_mx: También completamos el método ``end()`` para que cuando este comando se interrumpa o se detenga, los motores se detendrán como medida de seguridad.

source: Make Default Command
es_mx: Hacer el Comando por defecto

source: The last step is to make the Tank Drive command be the "Default Command" for the Drive Train subsystem. This means that whenever no other command is using the Drive Train, the Joysticks will be in control. This is probably the desirable behavior. When the autonomous code is running, it will also require the drive train and interrupt the Tank Drive command. When the autonomous code is finished, the DriveWithJoysticks command will restart automatically (because it is the default command), and the operators will be back in control. If you write any code that does teleop automatic driving, those commands should also "require" the DriveTrain so that they too will interrupt the Tank Drive command and have full control.
es_mx: El último paso es hacer que el comando Tank Drive sea el "Comando predeterminado" para el subsistema Drive Train. Esto significa que siempre que ningún otro comando esté usando Drive Train, los Joysticks tendrán el control. Este es probablemente el comportamiento deseable. Cuando el código autónomo se está ejecutando, también requerirá el tren de transmisión e interrumpirá el comando Tank Drive. Cuando finalice el código autónomo, el comando DriveWithJoysticks se reiniciará automáticamente (porque es el comando predeterminado) y los operadores volverán a tener el control. Si escribe cualquier código que haga teleoperación automática, esos comandos también deberían "requerir" el DriveTrain para que también interrumpan el comando Tank Drive y tengan control total.

source: Be sure to export your program to C++ or Java before continuing.
es_mx: Asegúrese de exportar su programa a C++ o Java antes de continuar.
