Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/convenience-features.po
Languages: tr_tr

source: Convenience Features
tr_tr: Kullanışlı Özellikler

source: While the previously-described methodologies will work fine for writing command-based robot code, the command-based libraries contain several convenience features for more-advanced users that can greatly reduce the verbosity/complexity of command-based code. It is highly recommended that users familiarize themselves with these features to maximize the value they get out of the command-based libraries.
tr_tr: Önceden açıklanan metodolojiler, komut tabanlı robot kodu yazmak için iyi çalışacak olsa da, komut tabanlı kitaplıklar, komut tabanlı kodun ayrıntı/ karmaşıklığını büyük ölçüde azaltabilen daha gelişmiş kullanıcılar için çeşitli kolaylık özellikleri içerir. Kullanıcıların, komut tabanlı kitaplıklardan elde ettikleri değeri en üst düzeye çıkarmak için bu özelliklere aşina olmaları şiddetle tavsiye edilir.

source: Inline Command Definitions
tr_tr: Inline-Satır İçi Komut Tanımları

source: While users are able to create commands by explicitly writing command classes (either by subclassing ``CommandBase`` or implementing ``Command``), for many commands (such as those that simply call a single subsystem method) this involves a lot of wasteful boilerplate code. To help alleviate this, many of the prewritten commands included in the command-based library may be *inlined* - that is, the command body can be defined in a single line of code at command construction.
tr_tr: Kullanıcılar açıkça komut sınıfları yazarak (``CommandBase`` alt sınıfını oluşturarak veya ``Command`` uygulayarak) komutlar oluşturabilirken, birçok komut için (tek bir alt sistem yöntemini çağıranlar gibi) bu, çok sayıda gereksiz standart kod gerektirir. Bunu hafifletmeye yardımcı olmak için, komut tabanlı kitaplıkta bulunan önceden yazılmış komutların çoğu *satır içi-inline* olabilir - yani komut gövdesi, komut oluşturma sırasında tek bir kod satırında tanımlanabilir.

source: Passing Subroutines As Parameters
tr_tr: Alt Yordamları-Subroutines Parametre Olarak Aktarma

source: In order to inline a command definition, users require some way to specify what code the commands will run as constructor parameters. Fortunately, both Java and C++ offer users the ability to pass subroutines as parameters.
tr_tr: Bir komut tanımını satır içi yapmak için, kullanıcılar komutların yapıcı parametreleri olarak hangi kodu çalıştıracağını belirtmek için bir yol gerektirir. Neyse ki, hem Java hem de C++, kullanıcılara alt rutinleri parametre olarak geçirme yeteneği sunar.

source: Method References (Java)
tr_tr: Method Referansları (Java)

source: In Java, a reference to a subroutine that can be passed as a parameter is called a method reference. The general syntax for a method reference is ``object::method``. Note that no method parameters are included, since the method *itself* is the parameter. The method is not being called - it is being passed to another piece of code (in this case, a command) so that *that* code can call it when needed. For further information on method references, see `the official Oracle documentation <https://docs.oracle.com/javase/tutorial/java/javaOO/methodreferences.html>`__.
tr_tr: Java'da, parametre olarak aktarılabilen bir alt yordama yapılan başvuruya yöntem başvurusu denir. Bir yöntem başvurusunun genel sözdizimi ``object::method`` dir. Yöntemin *kendisi* parametre olduğu için hiçbir yöntem parametresinin dahil edilmediğine dikkat edin. Yöntem çağrılmıyor - başka bir kod parçasına (bu durumda, bir komut) aktarılıyor, böylece * o * kod gerektiğinde onu çağırabilir. Yöntem referansları hakkında daha fazla bilgi için, bkz. `"Resmi Oracle dokümantasyonu <https://docs.oracle.com/javase/tutorial/java/javaOO/methodreferences.html>`__.

source: Lambda Expressions (Java)
tr_tr: Lambda İfadeleri (Java)

source: While method references work well for passing a subroutine that has already been written, often it is inconvenient/wasteful to write a subroutine solely for the purpose of sending as a method reference, if that subroutine will never be used elsewhere. To avoid this, Java also supports a feature called “lambda expressions.” A lambda expression is an inline method definition - it allows a subroutine to be defined *inside of a parameter list*. For specifics on how to write Java lambda expressions, see `this tutorial <https://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html#syntax>`__.
tr_tr: Yöntem referansları, önceden yazılmış bir alt yordamı iletmek için iyi çalışsa da, bir alt yordamı yalnızca bir yöntem referansı olarak göndermek amacıyla yazmak, bu alt yordam asla başka bir yerde kullanılmayacaksa, genellikle sakıncalıdır/israf olur. Bundan kaçınmak için Java, "lambda ifadeleri" adlı bir özelliği de destekler. Lambda ifadesi bir satır içi yöntem tanımıdır - bir alt yordamın bir parametre listesinin *içinde* tanımlanmasına izin verir. Java lambda ifadelerinin nasıl yazılacağına ilişkin ayrıntılar için bkz. `Bu eğitici <https://docs.oracle.com/javase/tutorial/java/javaOO/lambdaexpressions.html#syntax>`__.

source: Lambda Expressions (C++)
tr_tr: Lambda İfadeleri (C++)

source: C++ lacks a close equivalent to Java method references - pointers to member functions are generally not directly useable as parameters due to the presence of the implicit ``this`` parameter. However, C++ does offer lambda expressions - in addition, the lambda expressions offered by C++ are in many ways more powerful than those in Java. For specifics on how to write C++ lambda expressions, see `cppreference <https://en.cppreference.com/w/cpp/language/lambda>`__.
tr_tr: C++, Java yöntemi referanslarına yakın bir eşdeğerden yoksundur - üye işlevlere işaretçiler, örtük ``this`` parametresinin varlığı nedeniyle genellikle doğrudan parametre olarak kullanılamaz. Bununla birlikte, C++ lambda ifadeleri sunar - ek olarak, C++ tarafından sunulan lambda ifadeleri Java'dakilerden birçok yönden daha güçlüdür. C++ lambda ifadelerinin nasıl yazılacağına ilişkin ayrıntılar için bkz. `Cppreference <https://en.cppreference.com/w/cpp/language/lambda>`__.

source: Inlined Command Example
tr_tr: Satır İçi - inline Komut Örneği

source: So, what does an inlined command definition look like in practice?
tr_tr: Öyleyse, satır içi bir komut tanımı pratikte nasıl görünür?

source: The ``InstantCommand`` class provides an example of a type of command that benefits greatly from inlining. Consider the following from the HatchBotInlined example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__):
tr_tr: ``InstantCommand`` sınıfı, satır içi işlemden büyük ölçüde yararlanan bir komut türü örneği sağlar. HatchBotInlined örnek projesinden (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/hatchbotinlined>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/HatchbotInlined>`__) aşağıdakileri göz önünde bulundurun:

source: Instead of wastefully writing separate ``GrabHatch`` and ``ReleaseHatch`` commands which call only one method before ending, both can be accomplished with a simple inline definition by passing appropriate subsystem method.
tr_tr: Bitmeden önce yalnızca bir yöntemi çağıran ayrı ``GrabHatch`` ve ``ReleaseHatch`` komutlarını savurgan bir şekilde yazmak yerine, her ikisi de uygun alt sistem yöntemini geçerek basit bir satır içi tanımlamayla gerçekleştirilebilir.

source: Included Command Types
tr_tr: Dahil Edilen Komut Türleri

source: The command-based library includes a variety of pre-written commands for commonly-encountered use cases. Many of these commands are intended to be used “out-of-the-box” via `inlining <#inline-command-definitions>`_, however they may be subclassed, as well. A list of the included pre-made commands can be found below, along with brief examples of each - for more rigorous documentation, see the API docs (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>`__).
tr_tr: Komut tabanlı kitaplık, yaygın olarak karşılaşılan kullanım durumları için önceden yazılmış çeşitli komutlar içerir. Bu komutların birçoğunun, `inlining <#inline-command-definitions>`_ satır içi yoluyla "out-of-the-box, kutudan çıkar çıkmaz" kullanılması amaçlanmıştır, ancak alt sınıflara da ayrılmış olabilirler. Dahil edilen önceden hazırlanmış komutların bir listesi, her birinin kısa örnekleriyle birlikte aşağıda bulunabilir - daha ayrıntılı dokümantasyon için API belgelerine bakın (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/package-summary.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>` __).

source: The ``ConditionalCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ConditionalCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ConditionalCommand.html>`__) runs one of two commands when executed, depending on a user-specified true-or-false condition:
tr_tr: ``ConditionalCommand`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ConditionalCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ConditionalCommand.html>`__), kullanıcı tarafından belirtilen doğru veya yanlış koşuluna bağlı olarak çalıştırıldığında iki komuttan birini çalıştırır:

source: While the Java version of SelectCommand simply uses an ``Object`` as a key, the C++ version is templated on the key type.
tr_tr: SelectCommand'ın Java sürümü basitçe bir ``Object`` kullanırken, C++ sürümü anahtar türüne göre şablonlanmıştır.

source: An alternate version of SelectCommand simply takes a method that supplies the command to be run - this can be very succinct, but makes inferring the command's requirements impossible, and so leaves the user responsible for manually adding the requirements to the SelectCommand.
tr_tr: SelectCommand'ın alternatif bir sürümü, çalıştırılacak komutu sağlayan bir yöntemi kullanır - bu çok kısa olabilir, ancak komutun gereksinimlerini anlamayı imkansız hale getirir ve bu nedenle, gereksinimleri manuel olarak SelectCommand'e eklemekten kullanıcıyı sorumlu bırakır.

source: The ``SelectCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SelectCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SelectCommand.html>`__) is a generalization of the ``ConditionalCommand`` class that runs one of a selection of commands based on the value of a user-specified selector. The following example code is taken from the SelectCommand example project (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>`__, `C++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SelectCommand>`__):
tr_tr: ``SelectCommand`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SelectCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SelectCommand.html>` __), kullanıcı tanımlı bir seçicinin değerine dayalı olarak bir komut seçiminden birini çalıştıran ``ConditionalCommand`` sınıfının bir genellemesidir. Aşağıdaki örnek kod SelectCommand örnek projesinden alınmıştır (`Java <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/examples/selectcommand>` __, `C ++ <https://github.com/wpilibsuite/allwpilib/tree/master/wpilibcExamples/src/main/cpp/examples/SelectCommand>` __):

source: The ``InstantCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/InstantCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1InstantCommand.html>`__) executes a single action on initialization, and then ends immediately:
tr_tr: ``InstantCommand``sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/InstantCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1InstantCommand.html>` __), başlatma sırasında tek bir eylem yürütür ve ardından hemen sona erer:

source: The ``RunCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RunCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1RunCommand.html>`__) runs a specified method repeatedly in its ``execute()`` block. It does not have end conditions by default; users can either subclass it, or `decorate <#command-decorator-methods>`_ it to add them.
tr_tr: ``RunCommand`` sınıfı ("Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/RunCommand.html>" __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1RunCommand.html>` __), belirtilen bir yöntemi ``execute()`` bloğunda tekrar tekrar çalıştırır. Varsayılan olarak bitiş koşullarına sahip değildir; kullanıcılar ya alt sınıflara ayırabilir ya da eklemek için `<#command-decorator-methods>` _ süsleyebilir.

source: The ``StartEndCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/StartEndCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1StartEndCommand.html>`__) executes an action when starting, and a second one when ending. It does not have end conditions by default; users can either subclass it, or `decorate <#command-decorator-methods>`_ an inlined command to add them.
tr_tr: ``StartEndCommand`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/StartEndCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1StartEndCommand.html>` __), başlangıçta bir eylem ve biterken ikinci bir eylem yürütür. Varsayılan olarak bitiş koşullarına sahip değildir; kullanıcılar bunları alt sınıflara ayırabilir veya eklemek için satır içi bir komutu `<#command-decorator-methods>` _ dekore edebilir.

source: The ``FunctionalCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/FunctionalCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1FunctionalCommand.html>`__) allows all four ``Command`` methods to be passed in as method references or lambdas:
tr_tr: ``FunctionalCommand`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/FunctionalCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1FunctionalCommand.html>`__), dört ``Command`` yönteminin tümünün yöntem başvuruları veya lambdas olarak aktarılmasına izin verir:

source: The ``PrintCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PrintCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PrintCommand.html>`__) prints a given string.
tr_tr: ``PrintCommand`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PrintCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PrintCommand.html>`__) belirli bir dizeyi yazdırır.

source: ScheduleCommand
tr_tr: ScheduleCommand - Program Komutu

source: The ``ScheduleCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ScheduleCommand.html>`__) schedules a specified command, and ends instantly:
tr_tr: ``ScheduleCommand`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ScheduleCommand.html>` __, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ScheduleCommand.html>` __) belirli bir komutu zamanlar ve anında sona erer:

source: This is often useful for "forking off" from command groups: by default, commands in command groups are run *through* the command group, and are never themselves seen by the scheduler. Accordingly, their requirements are added to the group's requirements. While this is usually fine, sometimes it is undesirable for the entire command group to gain the requirements of a single command - a good solution is to "fork off" from the command group and schedule that command separately.
tr_tr: Bu genellikle komut gruplarından "forking off-çatallanma" için kullanışlıdır: varsayılan olarak, komut gruplarındaki komutlar, komut grubu boyunca *çalıştırılır* ve scheduler-zamanlayıcı tarafından asla görülmez. Buna göre, gereksinimleri grubun gereksinimlerine eklenir. Bu genellikle iyi olsa da, bazen tüm komut grubunun tek bir komutun gereksinimlerini karşılaması istenmeyen bir durumdur - iyi bir çözüm, komut grubundan "fork off - çatal atmak" ve bu komutu ayrı ayrı programlamaktır.

source: The ``ProxyScheduleCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProxyScheduleCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ProxyScheduleCommand.html>`__) schedules a specified command, and does not end until that command ends:
tr_tr: ``ProxyScheduleCommand`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/ProxyScheduleCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1ProxyScheduleCommand.html>` __) belirli bir komutu zamanlar ve bu komut sona erene kadar bitmez:

source: This is often useful for "forking off" from command groups: by default, commands in command groups are run *through* the command group, and are never themselves seen by the scheduler. Accordingly, their requirements are added to the group's requirements. While this is usually fine, sometimes it is undesirable for the entire command group to gain the requirements of a single command - a good solution is to "fork off" from the command group and schedule the command separately.
tr_tr: Bu genellikle komut gruplarından "forking off - çatallama" için kullanışlıdır: varsayılan olarak, komut gruplarındaki komutlar komut grubu *boyunca* çalıştırılır ve zamanlayıcı tarafından asla kendileri görülmez. Buna göre, gereksinimleri grubun gereksinimlerine eklenir. Bu genellikle iyi olsa da, bazen tüm komut grubunun tek bir komutun gereksinimlerini karşılaması istenmeyen bir durumdur - iyi bir çözüm, komut grubundan "fork off" ve komutu ayrı ayrı programlamaktır.

source: The ``WaitCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1WaitCommand.html>`__) does nothing, and ends after a specified period of time elapses after its initial scheduling:
tr_tr: ``WaitCommand`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1WaitCommand.html>` __) hiçbir şey yapmaz ve ilk zamanlamasının ardından belirli bir süre geçtikten sonra sona erer:

source: This is often useful as a component of a command group.
tr_tr: Bu genellikle bir komut grubunun bir bileşeni olarak kullanışlıdır.

source: ``WaitCommand`` can also be subclassed to create a more complicated command that runs for a period of time. If ``WaitCommand`` is used in this method, the user must ensure that the ``WaitCommand``'s ``Initialize``, ``End``, and ``IsFinished`` methods are still called in order for the WaitCommand's timer to work.
tr_tr: ``WaitCommand``, belirli bir süre boyunca çalışan daha karmaşık bir komut oluşturmak için de alt sınıflara ayrılabilir. Bu yöntemde WaitCommand'ın zamanlayıcısının çalışması için ``WaitCommand`` kullanılıyorsa, kullanıcı ``WaitCommand`` ın ``Initialize``, ``End`` ve ``IsFinished`` yöntemlerinin hala çağrıldığından emin olmalıdır.

source: The match timer used by WaitUntilCommand does *not* provide an official match time! While it is fairly accurate, use of this timer can *not* guarantee the legality of your robot's actions.
tr_tr: WaitUntilCommand tarafından kullanılan maç sayacı resmi bir maç saati *sağlamaz*! Oldukça doğru olsa da, bu zamanlayıcının kullanılması robotunuzun eylemlerinin yasallığını *garanti edemez*.

source: The ``WaitUntilCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitUntilCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1WaitUntilCommand.html>`__) does nothing, and ends once a specified condition becomes true, or until a specified match time passes.
tr_tr: ``WaitUntilCommand`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/WaitUntilCommand.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1WaitUntilCommand.html>` __) hiçbir şey yapmaz ve belirli bir koşul gerçekleştiğinde veya belirtilen bir eşleşme süresi geçene kadar sona erer.

source: The ``PerpetualCommand`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PerpetualCommand.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PerpetualCommand.html>`__) runs a given command with its end condition removed, so that it runs forever (unless externally interrupted):
tr_tr: ``PerpetualCommand`` sınıfı (`` Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/PerpetualCommand.html> '' __, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1PerpetualCommand.html>`), belirli bir komutu bitiş koşulu kaldırılmış olarak çalıştırır, böylece sonsuza kadar çalışır (harici olarak kesintiye uğramadıkça):

source: Command Decorator Methods
tr_tr: Command Dekoratör Yöntemleri
