Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/convenience-features.po
Languages: tr_tr

source: The ``Command`` interface contains a number of defaulted “decorator” methods which can be used to add additional functionality to existing commands. A “decorator” method is a method that takes an object (in this case, a command) and returns an object of the same type (i.e. a command) with some additional functionality added to it. A list of the included decorator methods with brief examples is included below - for rigorous documentation, see the API docs (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>`__).
tr_tr: ``Command-Komut`` arayüzü, mevcut komutlara ek işlevsellik eklemek için kullanılabilecek bir dizi varsayılan "dekoratör" yöntemi içerir. Bir "dekoratör" yöntemi, bir nesneyi (bu durumda, bir komut) alan ve ona bazı ek işlevler eklenmiş aynı türden bir nesneyi (yani bir komut) döndüren bir yöntemdir. Kısa örneklerle birlikte dahil edilen dekoratör yöntemlerinin bir listesi aşağıda verilmiştir - ayrıntılı dokümantasyon için API belgelerine bakın (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html>` __).

source: The ``withTimeout()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withTimeout(double)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a3a10e79038afc9bc7c98461b7dbb895b>`__) adds a timeout to a command. The decorated command will be interrupted if the timeout expires:
tr_tr: ``withTimeout()``dekoratörü (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withTimeout(double)>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a3a10e79038afc9bc7c98461b7dbb895b>` __) bir komuta zaman aşımı ekler. Zaman aşımı süresi dolarsa dekore edilmiş komut kesintiye uğrayacaktır:

source: The ``withInterrupt()`` (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withInterrupt(java.util.function.BooleanSupplier)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a4a6078c253a1578b3310833dcdfc01f0>`__) decorator adds a condition on which the command will be interrupted:
tr_tr: ``withInterrupt()'' (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#withInterrupt(java.util.function.BooleanSupplier)>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a4a6078c253a1578b3310833dcdfc01f0>` __) dekoratörü, komutun kesintiye uğrayacağı bir koşul ekler:

source: andThen
tr_tr: ve sonra

source: The ``andThen()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#andThen(java.lang.Runnable)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ade79bfb9d4ad670cdcb35369c0081b37>`__) adds a method to be executed after the command ends:
tr_tr: ``andThen()`` dekoratörü (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#andThen(java.lang.Runnable)>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ade79bfb9d4ad670cdcb35369c0081b37> `__), komut bittikten sonra yürütülecek bir yöntem ekler:

source: The ``beforeStarting()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#beforeStarting(java.lang.Runnable)>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a65155a6d7062deed375da196d2ba4c89>`__) adds a method to be executed before the command starts:
tr_tr: ``beforeStarting()`` dekoratörü (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#beforeStarting(java.lang.Runnable)>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#a65155a6d7062deed375da196d2ba4c89>` __), komut başlamadan önce yürütülecek bir yöntem ekler:

source: alongWith (Java only)
tr_tr: alongWith (yalnızca Java)

source: This decorator is not supported in C++ due to technical constraints - users should simply construct a parallel command group the ordinary way instead.
tr_tr: Bu dekoratör, teknik kısıtlamalar nedeniyle C++ 'da desteklenmez - kullanıcılar bunun yerine basit bir şekilde paralel bir komut grubu oluşturmalıdır.

source: The ``alongWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#alongWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a parallel command group containing the command, along with all the other commands passed in as arguments:
tr_tr: ``alongWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#alongWith(edu.wpi.first.wpilibj2.command.Command...)>`__, komutu içeren bir paralel komut grubu ile birlikte argüman olarak iletilen diğer tüm komutları döndürür:

source: raceWith (Java only)
tr_tr: raceWith (Sadece Java)

source: This decorator is not supported in C++ due to technical constraints - users should simply construct a parallel race group the ordinary way instead.
tr_tr: Bu dekoratör, teknik kısıtlamalar nedeniyle C++ 'da desteklenmez - kullanıcılar bunun yerine basit bir şekilde paralel bir yarış grubu oluşturmalıdır.

source: The ``raceWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#raceWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a parallel command race containing the command, along with all the other commands passed in as arguments:
tr_tr: ``raceWith()`` dekoratörü <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#raceWith(edu.wpi.first.wpilibj2.command.Command...)>`__, komutu içeren bir paralel komut yarışı ve argüman olarak iletilen diğer tüm komutları döndürür:

source: deadlineWith (Java only)
tr_tr: deadlineWith (Sadece Java)

source: This decorator is not supported in C++ due to technical constraints - users should simply construct a parallel deadline group the ordinary way instead.
tr_tr: Bu dekoratör, teknik kısıtlamalar nedeniyle C++ 'da desteklenmez - kullanıcılar bunun yerine basit bir şekilde paralel bir deadline grubu oluşturmalıdır.

source: The ``deadlineWith()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#deadlineWith(edu.wpi.first.wpilibj2.command.Command...)>`__ returns a parallel deadline group containing the command, along with all the other commands passed in as arguments:
tr_tr: ``deadlineWith()`` dekoratörü <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#deadlineWith(edu.wpi.first.wpilibj2.command.Command...)>``__, bağımsız değişken olarak iletilen diğer tüm komutlarla birlikte komutu içeren paralel bir son tarih grubu döndürür:

source: withName (Java only)
tr_tr: withName (yalnızca Java)

source: This decorator is not supported in C++ due to technical constraints - users should set the name of the command inside their command class instead.
tr_tr: Bu dekoratör, teknik kısıtlamalar nedeniyle C ++ 'da desteklenmez - kullanıcılar bunun yerine komutun adını kendi komut sınıfları içinde ayarlamalıdır.

source: The ``withName()`` `decorator <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#withName(java.lang.String)>`__ adds a name to a command. This name will appear on a dashboard when the command is sent via the `sendable interface <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#initSendable(edu.wpi.first.wpilibj.smartdashboard.SendableBuilder)>`__.
tr_tr: ``withName()``dekoratörü <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#withName(java.lang.String)> `__ bir komuta bir ad ekler. Bu ad, komut `gönderilebilir arabirim <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandBase.html#initSendable(edu.wpi.first.wpilibj.smartdashboard.SendableBuilder)>` __ aracılığıyla gönderildiğinde bir gösterge panosunda görünecektir.

source: perpetually
tr_tr: perpetually-sürekli

source: The ``perpetually()`` decorator (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#perpetually()>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ae1583c73c9b953d8ff730d4809926518>`__) removes the end condition of a command, so that it runs forever.
tr_tr: ``perpetually()` dekoratörü (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Command.html#perpetually()>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Command.html#ae1583c73c9b953d8ff730d4809926518>` __), sonsuza kadar çalışması için bir komutun bitiş koşulunu kaldırır.

source: Composing Decorators
tr_tr: Decorators-Dekoratörleri Oluşturmak

source: Remember that decorators, like all command groups, can be composed! This allows very powerful and concise inline expressions:
tr_tr: Tüm komut grupları gibi dekoratörlerin de oluşturulabileceğini unutmayın! Bu, çok güçlü ve kısa satır içi-inline ifadelere izin verir:

source: Static Factory Methods for Command Groups (Java only)
tr_tr: Komut Grupları için Statik Üretim Yöntemleri (yalnızca Java)

source: These factory methods are not included in the C++ command library, as the reduction in verbosity would be minimal - C++ commands should be stack-allocated, removing the need for the ``new`` keyword.
tr_tr: Bu üretim yöntemleri, ayrıntıdaki azalma minimum düzeyde olacağından C++ komut kitaplığına dahil edilmemiştir - C++ komutları, ``new`` anahtar sözcüğüne duyulan ihtiyacı ortadan kaldırarak yığın olarak tahsis edilmelidir.

source: If users do not wish to use the ``andThen``, ``alongWith``, ``raceWith``, and ``deadlineWith`` decorators for declaring command groups, but still wish to reduce verbosity compared to calling the constructors, the ``CommandGroupBase`` `class <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html>`__ contains four static factory methods for declaring command groups: ``sequence()``, ``parallel()``, ``race()``, and ``deadline()``. When used from within a command group subclass or in combination with ``import static``, these become extremely concise and greatly aid in command composition:
tr_tr: Kullanıcılar komut gruplarını bildirmek için ``andThen``, ``alongWith``, ``raceWith`` ve ``deadlineWith`` dekoratörlerini kullanmak istemiyor, ancak yine de kurucuları çağırmaya kıyasla ayrıntı düzeyini azaltmak istiyorsa, ` ``CommandGroupBase`` `sınıfı <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/CommandGroupBase.html>`__, komut gruplarını bildirmek için dört statik fabrika methodu içerir: ``sequence()``, ``parallel()``, ``race()`` ve ``deadline()``. Bir komut grubu alt sınıfından veya `` import static-içe aktarım durağan '' ile birlikte kullanıldığında bunlar son derece özlü hale gelir ve komut kompozisyonuna büyük ölçüde yardımcı olur:
