Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/commandbased/subsystems.po
Languages: tr_tr

source: Subsystems
tr_tr: Subsystems - Alt sistemler

source: Subsystems are the basic unit of robot organization in the command-based paradigm. A subsystem is an abstraction for a collection of robot hardware that *operates together as a unit*. Subsystems `encapsulate <https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)>`__ this hardware, “hiding” it from the rest of the robot code (e.g. commands) and restricting access to it except through the subsystem’s public methods. Restricting the access in this way provides a single convenient place for code that might otherwise be duplicated in multiple places (such as scaling motor outputs or checking limit switches) if the subsystem internals were exposed. It also allows changes to the specific details of how the subsystem works (the “implementation”) to be isolated from the rest of robot code, making it far easier to make substantial changes if/when the design constraints change.
tr_tr: Alt sistemler, komuta dayalı paradigmada robot organizasyonunun temel birimidir. Bir alt sistem, *birlikte bir birim olarak çalışan* bir robot donanım koleksiyonu için bir soyutlamadır. Alt sistemler `bu donanımı kapsar <https://en.wikipedia.org/wiki/Encapsulation_(computer_programming)>`__ , robot kodunun geri kalanından (örneğin komutlar) "gizler" ve alt sistemin genel yöntemleri dışında ona erişimi kısıtlar. Erişimi bu şekilde kısıtlamak, alt sistem iç bileşenleri açığa çıkarsa, aksi takdirde birden fazla yerde çoğaltılabilen (motor çıkışlarını ölçekleme veya limit anahtarlarını kontrol etme gibi) kod için tek bir uygun yer sağlar. Ayrıca, alt sistemin nasıl çalıştığına ("uygulama") ilişkin belirli ayrıntıların, robot kodunun geri kalanından izole edilmesine izin vererek, tasarım kısıtlamaları değiştiğinde / değiştiğinde önemli değişiklikler yapmayı çok daha kolay hale getirir.

source: Subsystems also serve as the backbone of the ``CommandScheduler``\ ’s resource management system. Commands may declare resource requirements by specifying which subsystems they interact with; the scheduler will never concurrently schedule more than one command that requires a given subsystem. An attempt to schedule a command that requires a subsystem that is already-in-use will either interrupt the currently-running command (if the command has been scheduled as interruptible), or else be ignored.
tr_tr: Alt sistemler aynı zamanda ``CommandScheduler`` ın kaynak yönetim sisteminin omurgası olarak görev yapar. Komutlar, hangi alt sistemlerle etkileşime gireceklerini belirleyerek kaynak gereksinimlerini bildirebilir; zamanlayıcı hiçbir zaman belirli bir alt sistemi gerektiren birden fazla komutu eşzamanlı olarak programlamaz. Halihazırda kullanımda olan bir alt sistemi gerektiren bir komut zamanlama girişimi ya o anda çalışan komutu keser (komut kesintiye uğrayabilir - interruptible olarak programlandıysa) ya da yok sayılır.

source: Subsystems can be associated with “default commands” that will be automatically scheduled when no other command is currently using the subsystem. This is useful for continuous “background” actions such as controlling the robot drive, or keeping an arm held at a setpoint. Similar functionality can be achieved in the subsystem’s ``periodic()`` method, which is run once per run of the scheduler; teams should try to be consistent within their codebase about which functionality is achieved through either of these methods. There is also a ``simulationPeriodic()`` method that is similar to ``periodic()`` except that it is only run during :doc:`Simulation </docs/software/wpilib-tools/robot-simulation/introduction>` and can be used to update the state of the robot. Subsystems are represented in the command-based library by the Subsystem interface (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Subsystem.html>`__).
tr_tr: Subsystems-Alt sistemler, alt sistemi şu anda başka bir komut kullanmadığında otomatik olarak zamanlanacak olan “default commands-varsayılan komutlarla” ilişkilendirilebilir. Bu, robot sürücüsünü kontrol etmek veya bir kolu ayar noktasında tutmak gibi sürekli “background-arka plan” eylemleri için kullanışlıdır. Benzer işlevsellik, zamanlayıcı her çalıştırmada bir kez çalıştırılan alt sistemin ``periodic()`` yönteminde elde edilebilir; takımlar, bu yöntemlerden herhangi biri aracılığıyla hangi işlevselliğin elde edildiği konusunda kod tabanları içinde tutarlı olmaya çalışmalıdır. Ayrıca ``periodic()`` e benzer bir ``animationPeriodic()`` yöntemi de vardır, tek farkı sadece şu sıralarda çalıştırılır :doc: `Simulation </docs/software/wpilib-tools/robot-simulation/introduction>` ve robotun durumunu güncellemek için kullanılabilir. Alt sistemler, Komut tabanlı kitaplıkta Alt Sistem arabirimi (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/Subsystem.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1Subsystem.html>` __) tarafından temsil edilir.

source: Creating a Subsystem
tr_tr: Bir Subsystem - Alt Sistem Oluşturma

source: The recommended method to create a subsystem for most users is to subclass the abstract ``SubsystemBase`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SubsystemBase.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SubsystemBase.html>`__), as seen in the command-based template (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/subsystems/ExampleSubsystem.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/subsystems/ExampleSubsystem.h>`__):
tr_tr: Çoğu kullanıcı için bir alt sistem oluşturmak için önerilen yöntem, soyut `` Subsystem Base '' sınıfını alt sınıflara ayırmaktır. (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj2/command/SubsystemBase.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc2_1_1SubsystemBase.html>`__), komut tabanlı şablonda da görüldüğü gibi (`Java <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibjExamples/src/main/java/edu/wpi/first/wpilibj/templates/commandbased/subsystems/ExampleSubsystem.java>`__, `C++ <https://github.com/wpilibsuite/allwpilib/blob/main/wpilibcExamples/src/main/cpp/templates/commandbased/include/subsystems/ExampleSubsystem.h>`__):

source: This class contains a few convenience features on top of the basic ``Subsystem`` interface: it automatically calls the ``register()`` method in its constructor to register the subsystem with the scheduler (this is necessary for the ``periodic()`` method to be called when the scheduler runs), and also implements the ``Sendable`` interface so that it can be sent to the dashboard to display/log relevant status information.
tr_tr: Bu sınıf, temel ``Subsystem`` arayüzünün üstünde birkaç kolaylık sağlar : alt sistemi zamanlayıcıya kaydetmek için constructor daki ``register()`` metodunu otomatik olarak çağırır (bu, ``periodic()`` zamanlayıcı çalıştığında çağrılacak yöntem) ve ayrıca ilgili durum bilgilerini görüntülemek / günlüğe kaydetmek için gösterge panosuna gönderilebilmesi için ``Sendable`` arayüzünü uygular.

source: Advanced users seeking more flexibility may simply create a class that implements the ``Subsystem`` interface.
tr_tr: Daha fazla esneklik arayan ileri düzey kullanıcılar, ``Subsystem`` arayüzünü uygulayan bir sınıf oluşturabilir.

source: Simple Subsystem Example
tr_tr: Basit Subsystem Örneği

source: Notice that the subsystem hides the presence of the DoubleSolenoid from outside code (it is declared ``private``), and instead publicly exposes two higher-level, descriptive robot actions: ``grabHatch()`` and ``releaseHatch()``. It is extremely important that “implementation details” such as the double solenoid be “hidden” in this manner; this ensures that code outside the subsystem will never cause the solenoid to be in an unexpected state. It also allows the user to change the implementation (for instance, a motor could be used instead of a pneumatic) without any of the code outside of the subsystem having to change with it.
tr_tr: Alt sistemin, DoubleSolenoid'in varlığını dış koddan gizlediğine (``private`` olarak bildirilir) ve bunun yerine iki yüksek seviyeli, açıklayıcı robot eylemini herkese açık olarak gösterdiğine dikkat edin: ``grabHatch()`` ve ``releaseHatch()``. Çift solenoid gibi “uygulama detaylarının” bu şekilde “gizlenmesi” son derece önemlidir; bu, alt sistem dışındaki kodun asla solenoidin beklenmedik bir durumda olmasına neden olmamasını sağlar. Aynı zamanda kullanıcının, alt sistem dışındaki kodun herhangi bir değişiklik gerekmeden uygulamayı değiştirmesine (örneğin, pnömatik yerine bir motor kullanılabilir) izin verir.

source: Setting Default Commands
tr_tr: Varsayılan Komutları Ayarlama

source: In the C++ command-based library, the CommandScheduler `owns` the default command objects - accordingly, the object passed to the ``SetDefaultCommand()`` method will be either moved or copied, depending on whether it is an rvalue or an lvalue (`rvalue/lvalue explanation <http://thbecker.net/articles/rvalue_references/section_01.html>`__). The examples here ensure that move semantics are used by casting to an rvalue with ``std::move()``.
tr_tr: C++ komut tabanlı kütüphanesinde, CommandScheduler varsayılan komut nesnelerine `owns` - buna göre, ``SetDefaultCommand()`` metoduna iletilen nesne, bir rvalue veya bir lvalue olmasına bağlı olarak ya taşınacak ya da kopyalanacaktır. (`rvalue/lvalue açıklaması <http://thbecker.net/articles/rvalue_references/section_01.html>`__). Buradaki örnekler, ``std::move()`` ile bir rvalue'ya çevrim yapılarak taşıma semantiğinin kullanılmasını sağlar.

source: "Default commands" are commands that run automatically whenever a subsystem is not being used by another command.
tr_tr: "Default commands" - Varsayılan komutlar, bir alt sistem başka bir komut tarafından kullanılmadığında otomatik olarak çalışan komutlardır.

source: Setting a default command for a subsystem is very easy; one simply calls ``CommandScheduler.getInstance().setDefaultCommand()``, or, more simply, the ``setDefaultCommand()`` method of the ``Subsystem`` interface:
tr_tr: Bir alt sistem için varsayılan bir komut ayarlamak çok kolaydır; basitçe ``CommandScheduler.getInstance().setDefaultCommand()`` veya daha basit bir şekilde ``Subsystem`` arayüzünün ``setDefaultCommand()`` metodunu çağırır:
