Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/contributing/frc-docs/build-instructions.po
Languages: tr_tr

source: Build Instructions
tr_tr: Derleme Yapısı

source: This document contains information on how to build the HTML, PDF, and EPUB versions of the frc-docs site. frc-docs uses Sphinx as the documentation generator. This document also assumes you have basic knowledge of `Git <https://git-scm.com/>`__ and console commands.
tr_tr: Bu belge, frc-docs sitesinin HTML, PDF ve EPUB sürümlerinin nasıl oluşturulacağı hakkında bilgiler içerir. frc-docs, dokümantasyon oluşturucu olarak Sphinx'i kullanır. Bu belge ayrıca `Git <https://git-scm.com/>" __ ve konsol komutları hakkında temel bilgiye sahip olduğunuzu varsayar.

source: Prerequisites
tr_tr: Gereksinimler

source: Ensure that `Git <https://git-scm.com/>`__ is installed and that the frc-docs repository is cloned by using ``git clone https://github.com/wpilibsuite/frc-docs.git``.
tr_tr: `Git <https://git-scm.com/>`__ 'in kurulu olduğundan ve frc-docs deposunun ``git clone https://github.com/wpilibsuite/frc-docs.git`` kullanılarak klonlandığından emin olun. ``.

source: The majority of MikTeX packages are not required for building HTML, additional packages may be required for building PDF and EPUB.
tr_tr: MikTeX paketlerinin çoğu HTML oluşturmak için gerekli değildir, PDF ve EPUB oluşturmak için ek paketler gerekebilir.

source: `Python 3.6 or greater <https://www.python.org/downloads/>`__
tr_tr: `Python 3.6 veya üstü <https://www.python.org/downloads/>`__

source: Ensure that Python is in your Path by selecting the **Add Python to PATH** toggle when installing Python.
tr_tr: Python'u yüklerken ** Add Python to PATH** seçimini yaparak sistem PATH 'inize eklendiğinden emin olun.

source: Once Python is installed, open up Powershell. Then navigate to the frc-docs directory. Run the following command: ``pip install -r source/requirements.txt``
tr_tr: Python kurulduktan sonra Powershell'i açın. Ardından frc-docs dizinine gidin. Aşağıdaki komutu çalıştırın: ``pip install -r source/requirements.txt``

source: Install the missing MikTex packages by navigating to the frc-docs directory, then running the following command from Powershell: ``mpm --verbose --require=@miktex-packages.txt``
tr_tr: Eksik MikTex paketlerini frc-docs dizinine gidip Powershell'den şu komutu çalıştırarak kurun: ``mpm --verbose --require=@miktex-packages.txt``

source: Lastly, you need to install ``rsvg-convert`` by running the ``scripts/install-rsvg-convert.ps1`` script in powershell. This requires administrator access.
tr_tr: Son olarak, powershell'de ``scripts/install-rsvg-convert.ps1`` komut dosyasını çalıştırarak ``rsvg-convert`` kurmanız gerekir. Bu, yönetici erişimi gerektirir.

source: Building
tr_tr: Derleme

source: Open up a Powershell Window or terminal and navigate to the frc-docs directory that was cloned.
tr_tr: Bir Powershell Penceresi veya terminali açın ve klonlanan frc-docs dizinine gidin.

source: Lint Check will not check line endings on Windows due to a bug with line endings. See `this issue <https://bugs.launchpad.net/doc8/+bug/1756704>`__ for more information.
tr_tr: Lint Check, satır sonlarıyla ilgili bir hata nedeniyle Windows'ta satır sonlarını kontrol etmeyecektir. Daha fazla bilgi için `bu soruna <https://bugs.launchpad.net/doc8/+bug/1756704>`__bakın.

source: It's encouraged to check any changes you make with the linter. This **will** fail the buildbot if it does not pass. To check, run ``.\make lint``
tr_tr: Linter ile yaptığınız değişiklikleri kontrol etmeniz önerilir. Bu başarılı olmazsa buildbot'ta başarısız **olacaktır**. Kontrol etmek için ``. \ Make lint`` komutunu çalıştırın.

source: Link Check
tr_tr: Link Check - Bağlantı Denetleme

source: The link checker makes sure that all links in the documentation resolve. This **will** fail the buildbot if it does not pass. To check, run ``.\make linkcheck``
tr_tr: Bağlantı denetleyicisi, belgelerdeki tüm bağlantıların çözümlendiğinden emin olur. Bu başarılı olmazsa buildbot'ta başarısız **olacaktır**. Kontrol etmek için ``. \ Make linkcheck`` komutunu çalıştırın.

source: Image Size Check
tr_tr: Resim boyutu denetimi

source: Please run ``.\make sizecheck`` to verify that all images are below 500KB. This check *will* fail CI if it fails. Exclusions are allowed on a case by case basis and are added to the ``IMAGE_SIZE_EXCLUSIONS`` list in the configuration file.
tr_tr: Tüm görüntülerin 500KB'nin altında olduğunu doğrulamak için lütfen ``. \ Make sizecheck`` komutunu çalıştırın. Bu kontrol başarısız olursa CI'da başarısız *olacaktır*. Kontrolde göz ardı edilecekler ``IMAGE_SIZE_EXCLUSIONS`` konfigürasyon listesine tek tek eklenir.

source: Redirect Check
tr_tr: Yönlendirme Kontrolü

source: Files that have been moved or renamed must have their new location (or replaced with 404) in the ``redirects.txt`` file in ``source``.
tr_tr: Taşınan veya yeniden adlandırılan dosyaların yeni konumları (veya 404 ile değiştirilmiş) `` kaynak '' içindeki `` redirects.txt '' dosyasında bulunmalıdır.

source: The redirect writer will automatically add renamed/moved files to the redirects file. Run ``.\make rediraffewritediff``.
tr_tr: Yönlendirme yazıcısı, yeniden adlandırılmış / taşınmış dosyaları yeniden yönlendirmeler dosyasına otomatik olarak ekleyecektir. Çalıştır ``.\make rediraffewritediff``.

source: if a file is both moved and substantially changed, the redirect writer will not add it to the ``redirects.txt`` file, and the ``redirects.txt`` file will need to be manually updated.
tr_tr: bir dosya hem taşınırsa hem de önemli ölçüde değiştirilirse, yeniden yönlendirme yazıcısı onu `` redirects.txt '' dosyasına eklemeyecek ve ``redirects.txt`` dosyasının manuel olarak güncellenmesi gerekecektir.

source: The redirect checker makes sure that there are valid redirects for all files. This **will** fail the buildbot if it does not pass. To check, run ``.\make rediraffecheckdiff`` to verify all files are redirected. Additionally, an HTML build may need to be ran to ensure that all files redirect properly.
tr_tr: Yeniden yönlendirme denetleyicisi, tüm dosyalar için geçerli yeniden yönlendirmeler olduğundan emin olur. Bu **, başarılı olmazsa buildbot'ta başarısız olur **. Kontrol etmek için, tüm dosyaların yeniden yönlendirildiğini doğrulamak için ``.\make rediraffecheckdiff`` komutunu çalıştırın. Ek olarak, tüm dosyaların düzgün bir şekilde yeniden yönlendirilmesini sağlamak için bir HTML yapısının çalıştırılması gerekebilir.

source: Building HTML
tr_tr: HTML Derleme

source: Type the command ``.\make html`` to generate HTML content. The content is located in the ``build/html`` directory at the root of the repository.
tr_tr: HTML içeriği oluşturmak için ``.\make html`` komutunu yazın. İçerik depo kök dizinindeki ``build/html`` dizininde bulunur.

source: Building PDF
tr_tr: PDF Oluşturma

source: Please note that PDF build on Windows may result in distorted images for SVG content. This is due to a lack of librsvg2-bin support on Windows.
tr_tr: Windows üzerinde PDF derlemesinin SVG içeriği için bozuk görüntülere neden olabileceğini lütfen unutmayın. Bunun nedeni, Windows'ta librsvg2-bin desteğinin olmamasıdır.

source: Type the command ``.\make latexpdf`` to generate PDF content. The PDF is located in the ``build/latex`` directory at the root of the repository.
tr_tr: PDF içeriği oluşturmak için ``.\make Latekspdf`` komutunu yazın. PDF, arşivin kök dizinindeki ``build/latex`` dizininde bulunur.

source: Building EPUB
tr_tr: EPUB Derlemek

source: Type the command ``.\make epub`` to generate EPUB content. The EPUB is located in the ``build/epub`` directory at the root of the repository.
tr_tr: EPUB içeriği oluşturmak için ``.\ Make epub`` komutunu yazın. EPUB, deponun kök dizinindeki ``build/epub`` dizininde bulunur.
