Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/advanced/robotbuilder-pidsubsystem-actuators.po
Languages: tr_tr

source: Using PIDSubsystem to Control Actuators
tr_tr: Aktüatörleri Kontrol Etmek İçin PIDSubsystem Kullanımı

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut temelli çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ deposuna bakabilirler.

source: More advanced subsystems will use sensors for feedback to get guaranteed results for operations like setting elevator heights or wrist angles. The PIDSubsystem has a built-in PIDController to automatically set the correct setpoints for these types of mechanisms.
tr_tr: Daha gelişmiş alt sistemler, kaldırıcı yüksekliklerinin veya bilek açılarının ayarlanması gibi işlemlerde garantili sonuçlar elde etmek için geri bildirim için sensörleri kullanır. PIDSubsystem, bu tür mekanizmalar için doğru ayar noktalarını otomatik olarak ayarlamak için yerleşik bir PIDController'a sahiptir.

source: Create a PIDSubsystem
tr_tr: Bir PIDS alt sistemi oluşturun

source: Creating a subsystem that uses feedback to control the position or speed of a mechanism is very easy.
tr_tr: Bir mekanizmanın konumunu veya hızını kontrol etmek için geri bildirim kullanan bir alt sistem oluşturmak çok kolaydır.

source: Drag a PIDSubsystem from the palette to the Subsystems folder in the robot description
tr_tr: Paletten bir PIDS alt sistemini robot açıklamasındaki Alt Sistemler klasörüne sürükleyin

source: Rename the PID Subsystem to a more meaningful name for the subsystem
tr_tr: PID Alt Sistemini alt sistem için daha anlamlı bir adla yeniden adlandırın

source: Notice that some of the parts of the robot description have turned red. This indicates that these components (the PIDSubsystem) haven't been completed and need to be filled in. The properties that are either missing or incorrect are shown in red.
tr_tr: Robot açıklamasının bazı bölümlerinin kırmızıya döndüğüne dikkat edin. Bu, bu bileşenlerin (PIDSubsystem) tamamlanmadığını ve doldurulması gerektiğini gösterir. Eksik veya yanlış olan özellikler kırmızı ile gösterilir.

source: Adding Sensors and Actuators to the PIDSubsystem
tr_tr: PIDS alt sistemine Sensör ve Aktüatör Ekleme

source: Add the missing components for the PIDSubsystem
tr_tr: PIDS alt sistemi için eksik bileşenleri ekleyin

source: Drag in the actuator (a motor controller) to the particular subsystem - in this case the Elevator
tr_tr: Aktüatörü (bir motor kontrolörü) belirli bir alt sisteme sürükleyin - bu durumda Kaldırıcı

source: Drag the sensor that will be used for feedback to the subsystem, in this case the sensor is a potentiometer that might give elevator height feedback.
tr_tr: Geri bildirim için kullanılacak sensörü alt sisteme sürükleyin; bu durumda sensör, asansör yüksekliği geri bildirimi verebilecek bir potansiyometredir.

source: Fill in the PIDSubsystem Parameters
tr_tr: PIDSubsystem Parametrelerini doldurun

source: There a number of parameters for the PIDSubsystem but only a few need to be filled in for most cases
tr_tr: PIDS alt sistemi için bir dizi parametre vardır, ancak çoğu durumda yalnızca birkaçının doldurulması gerekir

source: The Input and Output components will have been filled in automatically from the previous step when the actuator and sensor were dragged into the PIDSubsystem
tr_tr: Giriş ve Çıkış bileşenleri, aktüatör ve sensör PIDS alt sistemine sürüklendiğinde önceki adımdan otomatik olarak doldurulmuş olacaktır.

source: The P, I, and D values need to be filled in to get the desired sensitivity and stability of the component
tr_tr: Bileşenin istenen hassasiyetini ve kararlılığını elde etmek için P, I ve D değerlerinin doldurulması gerekir
