Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robotbuilder/advanced/robotbuilder-setpoint-command.po
Languages: es_mx, tr_tr

source: Setpoint Command
es_mx: Comando de punto de ajuste
tr_tr: Ayar Noktası Komutu

source: RobotBuilder has been updated to support the new commandbased framework! Unfortunately, this documentation is outdated and only for the old commandbased framework. Individuals interested in updating this documentation can open a pull request on the `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ repository.
es_mx: ¡RobotBuilder se ha actualizado para admitir el nuevo marco basado en comandos! Desafortunadamente, esta documentación está desactualizada y solo es para el antiguo marco basado en comandos. Las personas interesadas en actualizar esta documentación pueden abrir una solicitud en el repositorio `frc-docs <https://github.com/wpilibsuite/frc-docs>`__.
tr_tr: RobotBuilder, yeni komut tabanlı çerçeveyi desteklemek için güncellendi! Ne yazık ki, bu dokümantasyon güncelliğini yitirmiştir ve yalnızca eski komut tabanlı çerçeve içindir. Bu dokümantasyonu güncellemekle ilgilenen kişiler, `frc-docs <https://github.com/wpilibsuite/frc-docs>`__ havuzunda bir çekme isteği açabilir.

source: A common use case in robot programs is to drive an actuator to a particular angle or position that is measured using a potentiometer or encoder. This happens so often that there is a shortcut in RobotBuilder to do this task. It is called the Setpoint command and it's one of the choices on the palette or the right-click context menu that can be inserted under "Commands".
es_mx: Un caso de uso común en los programas de robots es conducir un actuador a un ángulo o posición particular que se mide con un potenciómetro o codificador. Esto sucede con tanta frecuencia que hay un atajo en RobotBuilder para realizar esta tarea. Se llama comando Setpoint y es una de las opciones de la paleta o del menú contextual del botón derecho que se puede insertar en "Comandos".
tr_tr: Robot programlarında yaygın bir kullanım durumu, bir aktüatörü, bir potansiyometre veya kodlayıcı kullanılarak ölçülen belirli bir açı veya konuma sürmektir. Bu o kadar sık olur ki, RobotBuilder'da bu görevi yapmak için bir kısayol vardır. Ayar noktası komutu olarak adlandırılır ve paletteki veya "Komutlar" altına eklenebilen sağ tıklama bağlam menüsündeki seçeneklerden biridir.

source: Start with a PIDSubsystem
es_mx: Comience con un subsistema PIDS
tr_tr: Bir PIDS alt sistemi ile başlayın

source: Suppose in a robot there is a wrist joint with a potentiometer that measures the angle. First :doc:`create a PIDSubsystem <robotbuilder-writing-pidsubsystem-code>` that include the motor that moves the wrist joint and the potentiometer that measures the angle. The PIDSubsystem should have all the PID constants filled in and working properly.
tr_tr: Bir robotta, açıyı ölçen potansiyometreli bir bilek eklemi olduğunu varsayalım. Bilek eklemini hareket ettiren motoru ve açıyı ölçen potansiyometreyi içeren bir PIDS alt sistemi First :doc:`create a PIDSubsystem <robotbuilder-writing-pidsubsystem-code>` oluşturun. PIDS alt sisteminde tüm PID sabitleri doldurulmuş ve düzgün çalışıyor olmalıdır.

source: It is important to set the **Tolerance** parameter. This controls how far off the current value can be from the setpoint and be considered on target. This is the criteria that the SetpointCommand uses to move onto the next command.
es_mx: Es importante configurar el parámetro **Tolerancia**. Esto controla qué tan lejos puede estar el valor actual del punto de ajuste y considerarse dentro del objetivo. Este es el criterio que utiliza SetpointCommand para pasar al siguiente comando.
tr_tr: ** Tolerans ** parametresini ayarlamak önemlidir. Bu, mevcut değerin ayar noktasından ne kadar uzakta olabileceğini ve hedefte değerlendirilebileceğini kontrol eder. Bu, Ayar Noktası Komutunun bir sonraki komuta geçmek için kullandığı kriterdir.

source: Creating the Setpoint Command
es_mx: Creación del comando de punto de ajuste
tr_tr: Ayar Noktası Komutunu Oluşturma

source: Right-click on the Commands folder in the palette and select "Add Setpoint command".
es_mx: Haga clic derecho en la carpeta Comandos de la paleta y seleccione "Agregar comando de punto de ajuste".
tr_tr: Paletteki Komutlar klasörüne sağ tıklayın ve "Ayar Noktası Ekle komutu" nu seçin.

source: Setpoint Command Parameters
es_mx: Parámetros de comando de punto de ajuste
tr_tr: Ayar Noktası Komut Parametreleri

source: Fill in the name of the new command. The Requires field is the PIDSubsystem that is being driven to a setpoint and the Setpoint parameter is the setpoint value for the PIDSubsystem. There is no need to fill in any code for this command, it is automatically created by RobotBuilder.
es_mx: Complete el nombre del nuevo comando. El campo Requiere es el subsistema PIDS que está siendo conducido a un punto de ajuste y el parámetro Punto de ajuste es el valor del punto de ajuste para el subsistema PIDS. No es necesario completar ningún código para este comando, RobotBuilder lo crea automáticamente.
tr_tr: Yeni komutun adını girin. Required alanı, bir ayar noktasına sürülen PIDS alt sistemidir ve Ayar noktası parametresi, PIDS alt sistemi için ayar noktası değeridir. Bu komut için herhangi bir kod doldurmaya gerek yoktur, RobotBuilder tarafından otomatik olarak oluşturulur.

source: Whenever this command is scheduled, it will automatically drive the subsystem to the specified setpoint. When the setpoint is reached within the tolerance specified in the PIDSubsystem, the command ends and the next command starts. It is important to specify a tolerance in the PIDSubsystem or this command might never end because the tolerance is not achieved.
es_mx: Siempre que se programe este comando, conducirá automáticamente el subsistema al punto de ajuste especificado. Cuando se alcanza el punto de ajuste dentro de la tolerancia especificada en el subsistema PIDS, el comando finaliza y comienza el siguiente comando. Es importante especificar una tolerancia en el subsistema PIDS o es posible que este comando nunca finalice porque no se logra la tolerancia.
tr_tr: Bu komut her zamanlandığında, alt sistemi otomatik olarak belirtilen ayar noktasına yönlendirecektir. PIDS alt sisteminde belirtilen tolerans dahilinde ayar noktasına ulaşıldığında, komut sona erer ve bir sonraki komut başlar. PIDS alt sisteminde bir tolerans belirtmek önemlidir veya bu komut tolerans sağlanamadığı için asla bitmeyebilir.

source: For more information about PID Control, please see the :ref:`Advanced Controls Introduction <docs/software/advanced-controls/introduction/index:Advanced Controls Introduction>`.
es_mx: Para obtener más información sobre el control PID, consulte :ref:`Advanced Controls Introduction <docs/software/advanced-controls/introduction/index:Advanced Controls Introduction>`.
tr_tr: PID Kontrolü hakkında daha fazla bilgi için lütfen bakınız:ref:`Advanced Controls Introduction <docs/software/advanced-controls/introduction/index:Advanced Controls Introduction>`.
