Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/controllers/combining-feedforward-feedback.po
Languages: tr_tr

source: Combining Feedforward and PID Control
tr_tr: Feedforward - ileribesleme ve PID Kontrolünü Birleştirme

source: Todo
tr_tr: Yapılacaklar

source: link to conceptual article when available
tr_tr: mevcut olduğunda kavramsal makaleye bağlantı

source: This article covers the in-code implementation of combined feedforward/PID control with WPILib's provided library classes. Documentation describing the involved concepts in more detail is forthcoming.
tr_tr: Bu makale, WPILib'in sağladığı kütüphane sınıfları ile birlikte feedforward/PID kontrolünün kod içi uygulamasını kapsar. İlgili kavramları daha ayrıntılı olarak açıklayan belgeler yakında çıkacaktır.

source: Feedforward and feedback controllers can each be used in isolation, but are most effective when combined together. Thankfully, combining these two control methods is *exceedingly* straightforward - one simply adds their outputs together.
tr_tr: Feedforward ve geri bildirim denetleyicilerinin her biri ayrı ayrı kullanılabilir, ancak birlikte kullanıldığında en etkilidir. Neyse ki, bu iki kontrol yöntemini birleştirmek *son derece* basittir - basitçe çıktılarını bir araya getirir.

source: Using Feedforward with a PIDController
tr_tr: Feedforward'ı bir PIDController ile kullanma

source: Users familiar with the old ``PIDController`` class may notice the lack of any feedforward gain in the new controller. As users are expected to use the controller output themselves, there is no longer any need for the ``PIDController`` to implement feedforward - users may simply add any feedforward they like to the output of the controller before sending it to their motors:
tr_tr: Eski ``PIDController`` sınıfına aşina olan kullanıcılar, yeni denetleyicide herhangi bir feedforward kazancının eksikliğini fark edebilir. Kullanıcıların kontrolör çıkışını kendilerinin kullanması beklendiğinden, feedforward' ı uygulamak için artık ``PIDController`` e ihtiyaç yoktur - kullanıcılar, kontrolör çıkışına istedikleri herhangi bir feedforward' ı motorlarına göndermeden önce ekleyebilirler:

source: Moreover, feedforward is a separate feature entirely from feedback, and thus has no reason to be handled in the same controller object, as this violates separation of concerns. WPILib comes with several helper classes to compute accurate feedforward voltages for common FRC\ |reg| mechanisms - for more information, see :ref:`docs/software/advanced-controls/controllers/feedforward:Feedforward Control in WPILib`.
tr_tr: Dahası, ileri besleme, tamamen geri bildirimden ayrı bir özelliktir ve bu nedenle, endişelerin ayrılmasını ihlal ettiği için aynı denetleyici nesnesinde ele alınması için bir neden yoktur. WPILib, ortak FRC \ |reg| için doğru ileri besleme voltajlarını hesaplamak üzere birkaç yardımcı sınıfla birlikte gelir. mekanizmalar - daha fazla bilgi için bkz : ref: `docs / software / advanced-controls / controller / feedforward: Feedforward Control in WPILib`.

source: Using Feedforward Components with PID
tr_tr: PID ile Feedforward Bileşenlerini Kullanma

source: Since feedforward voltages are physically meaningful, it is best to use the ``setVoltage()`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/SpeedController.html#setVoltage(double)>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1SpeedController.html#a8252b1dbd027218c7966b15d0f9faff7>`__) method when applying them to motors to compensate for "voltage sag" from the battery.
tr_tr: Feedforward voltajları fiziksel olarak anlamlı olduğundan, en iyisi; ``setVoltage()`` (`Java <https://first.wpi.edu/FRC/roborio/release/docs/java/edu/wpi/first/wpilibj/SpeedController.html#setVoltage(double)>`__, `C++ <https://first.wpi.edu/FRC/roborio/release/docs/cpp/classfrc_1_1SpeedController.html#a8252b1dbd027218c7966b15d0f9faff7>`__) bu yöntemi aküden gelen "gerilim sarkmasını" telafi etmek için bunları motorlara uygularken kullanırız.

source: What might a more complete example of combined feedforward/PID control look like? Consider the :ref:`drive example <docs/software/advanced-controls/controllers/feedforward:Using Feedforward to Control Mechanisms>` from the feedforward page. We can easily modify this to include feedback control (with a ``SimpleMotorFeedforward`` component):
tr_tr: Feedforward / PID kontrolünün daha eksiksiz bir örneği neye benzeyebilir? Feedforward sayfasından :ref:`sürüş örneği <docs/software/advanced-controls/controllers/feedforward:Using Feedforward to Control Mechanisms>` dikkate alınız. Geri bildirim kontrolünü dahil etmek için bunu kolayca değiştirebiliriz ( ``SimpleMotorFeedforward`` bileşeni ile)

source: Other mechanism types can be handled similarly.
tr_tr: Diğer mekanizma türleri de benzer şekilde ele alınabilir.
