Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/advanced-controls/geometry/pose.po
Languages: tr_tr, zh_cn

source: Translation, Rotation, and Pose
tr_tr: Ötelenme, Dönme ve Poz
zh_cn: 平移、旋转和姿态

source: Translation
tr_tr: Ötelenme
zh_cn: 翻译

source: Translation in 2 dimensions is represented by WPILib's ``Translation2d`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/geometry/Translation2d.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Translation2d.html>`__). This class has an x and y component, representing the point :math:`(x, y)` or the vector :math:`\begin{bmatrix}x \\ y \end{bmatrix}` on a 2-dimensional coordinate system.
tr_tr: 2 boyutlu çeviri, WPILib'in ``Translation2d`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/geometry/Translation2d.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Translation2d.html>` __) ile temsil edilir. Bu sınıf, 2 boyutlu bir koordinatta noktayı temsil eden bir x ve y bileşenine sahiptir: math: `(x, y)` veya vector: math: `\ begin {bmatrix} x \\ y \ end {bmatrix}` sistemi.
zh_cn: 二维翻译由WPILib的Translation2d类（Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/geometry/Translation2d.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Translation2d.html>`__）表示。此类具有x和y分量，表示二维点上的点：math：`（x，y）`或矢量：math：`\ begin {bmatrix} x \\ y \ end {bmatrix}`系统。

source: You can get the distance to another ``Translation2d`` object by using the ``getDistance(Translation2d other)``, which returns the distance to another Translation2d by using the Pythagorean theorem.
tr_tr: Pisagor teoremini kullanarak mesafeyi başka bir Translation2d'ye döndüren ``getDistance(Translation2d other)`` kullanarak başka bir ``Translation2d`` nesnesine olan mesafeyi elde edebilirsiniz.
zh_cn: 您可以使用“ getDistance（Translation2d other）”来获取到另一个“ Translation2d”对象的距离，该距离可以通过毕达哥拉斯定理返回到另一个Translation2d的距离。

source: ``Translation2d`` uses the C++ Units library. If you're planning on using other WPILib classes that use ``Translation2d`` in Java, such as the trajectory generator, make sure to use meters.
tr_tr: ``Translation2d``, C++ Units kütüphanesini kullanır. Yörünge oluşturucu gibi Java'da ``Translation2d`` kullanan diğer WPILib sınıflarını kullanmayı planlıyorsanız, metre ölçüsünü kullandığınızdan emin olun.
zh_cn: ``Translation2d``使用了c++单元库。如果你计划使用Java中使用``Translation2d`` 的其他WPILib类，如轨迹生成器，请确保使用仪表。

source: Rotation
tr_tr: Dönme
zh_cn: 旋转

source: Rotation in 2 dimensions is representated by WPILib's ``Rotation2d`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/geometry/Rotation2d.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Rotation2d.html>`__). This class has an angle component, which represents the robot's rotation relative to an axis on a 2-dimensional coordinate system. Positive rotations are counterclockwise.
tr_tr: 2 boyutlu rotasyon, WPILib'in ``Rotation2d``sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/geometry/Rotation2d.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Rotation2d.html>` __) tarafından temsil edilir. Bu sınıf, robotun 2 boyutlu koordinat sistemindeki bir eksene göre dönüşünü temsil eden bir açı bileşenine sahiptir. Pozitif dönüşler saat yönünün tersidir.
zh_cn: 二维尺寸的旋转由WPILib的``Rotation2d''类（`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/geometry/Rotation2d.html>`__，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Rotation2d.html>`__）表示。该类具有一个角度分量，该角度分量表示机器人相对于二维坐标系上的轴的旋转。正旋转为逆时针方向。

source: ``Rotation2d`` uses the C++ Units library. The contructor in Java accepts either the angle in radians, or the sine and cosine of the angle, but the ``fromDegrees`` method will construct a ``Rotation2d`` object from degrees.
tr_tr: ``Rotation2d``, C++ Units kütüphanesini kullanır. Java'daki yapıcı ya radyan cinsinden açıyı ya da açının sinüsünü ve kosinüsünü kabul eder, ancak ``fromDegrees`` yöntemi derecelerden bir ``Rotation2d`` nesnesi oluşturacaktır.
zh_cn: ``Rotation2d``使用C ++单元库。 Java中的构造函数可以接受以弧度为单位的角度，也可以接受该角度的正弦和余弦，但是fromDegrees方法将根据度数构造一个“ Rotation2d”对象。

source: Pose
tr_tr: Poz
zh_cn: 位姿

source: Pose is a combination of both translation and rotation and is represented by the ``Pose2d`` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/geometry/Pose2d.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Pose2d.html>`__). It can be used to describe the pose of your robot in the field coordinate system, or the pose of objects, such as vision targets, relative to your robot in the robot coordinate system. ``Pose2d`` can also represent the vector :math:`\begin{bmatrix}x \\ y \\ \theta\end{bmatrix}`.
tr_tr: Pose, hem çevirinin hem de döndürmenin bir kombinasyonudur ve ``Pose2d`` sınıfı (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/geometry/Pose2d.html>` __, `C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Pose2d.html>` __) ile temsil edilir. Alan koordinat sistemindeki robotunuzun pozunu veya robot koordinat sistemindeki robotunuza göre görme hedefleri gibi nesnelerin pozunu tanımlamak için kullanılabilir. ``Pose2d`` aynı zamanda matematik: `\ begin {bmatrix} x \\ y \\ \ theta \ end {bmatrix} 'vektörünü de temsil edebilir.
zh_cn: 姿态是平移和旋转的组合，由“ Pose2d”类（Java a065bb98126709zz` __，`C ++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Pose2d.html>`__）表示。它可用于描述您的机器人在场坐标系中的姿态，或相对于机器人在坐标系中的物体（例如视觉目标）的姿态。 ``pose2d``也可以表示向量：\ begin {bmatrix} x \\ y \\ \ theta \ end {bmatrix}`。
