Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/vscode-overview/importing-gradle-project.po
Languages: tr_tr

source: Importing a Gradle Project
tr_tr: Bir Gradle Projesini İçe Aktarma

source: Due to changes in the project, it is necessary to update the build files for a previous years Gradle project. It is also necessary to import vendor libraries again, since last year's vendor libraries must be updated to be compatible with this year's projects.
tr_tr: Projedeki değişiklikler nedeniyle, önceki yıllara ait bir Gradle projesinin yapı dosyalarının güncellenmesi gerekmektedir. Geçen yılki satıcı kitaplıklarının bu yılki projelerle uyumlu olacak şekilde güncellenmesi gerektiğinden, satıcı kitaplıklarını yeniden içe aktarmak da gereklidir.

source: Automatic Import
tr_tr: Otomatik İçe Aktarma

source: To make it easy for teams to import previous years gradle projects into the current year's framework, WPILib includes a wizard for importing previous years projects into VS Code. This will generate the necessary gradle components and load the project into VS Code. In place upgrades are not supported. The importer automatically imports the old or new command framework 3rd party library (which ever one was used on the imported project).
tr_tr: Ekiplerin önceki yılların mezun projelerini cari yılın çerçevesine aktarmasını kolaylaştırmak için WPILib, önceki yıl projelerini VS Code'a aktarmak için bir sihirbaz içerir. Bu, gerekli derecelendirme bileşenlerini oluşturacak ve projeyi VS Koduna yükleyecektir. Yerinde yükseltmeler desteklenmez. İthalatçı, eski veya yeni komut çerçevesi 3. taraf kitaplığını (içe aktarılan projede hangisi kullanılmışsa) otomatik olarak içe aktarır.

source: The import process copies your project source files from the current directory to a new directory and completely regenerates the gradle files. If you made non-standard updates to the build.gradle, you will need to make those changes again. For this reason, in place upgrades are not supported. It is also necessary to import vendor libraries again, since last year's vendor libraries must be updated to be compatible with this year's projects.
tr_tr: İçe aktarma işlemi, proje kaynak dosyalarınızı geçerli dizinden yeni bir dizine kopyalar ve derecelendirme dosyalarını tamamen yeniden oluşturur. Build.gradle'da standart olmayan güncellemeler yaptıysanız, bu değişiklikleri yeniden yapmanız gerekecektir. Bu nedenle, yerinde yükseltmeler desteklenmemektedir. Geçen yılki satıcı kütüphanelerinin bu yılki projelerle uyumlu olacak şekilde güncellenmesi gerektiğinden, satıcı kütüphanelerini tekrar içe aktarmak da gereklidir.

source: Launching the Import Wizard
tr_tr: İçe Aktarma Sihirbazını Başlatma

source: When you open a previous year's project, you will be prompted to import that project. Click :guilabel:`yes`.
tr_tr: Bir önceki yılın projesini açtığınızda, o projeyi içeri aktarmanız istenecektir. Tıklayın:guilabel:`yes`.

source: Alternately, you can chose to import it from the menu. Press :kbd:`Ctrl+Shift+P` and type "WPILib" or click the WPILib icon to locate the WPILib commands. Begin typing "Import a WPILib 2020 Gradle project" and select it from the dropdown as shown below.
tr_tr: Alternatif olarak, menüden içe aktarmayı da seçebilirsiniz. WPILib komutlarını bulmak için :kbd:`Ctrl+Shift+P` ye basın ve" WPILib "yazın veya WPILib simgesini tıklayın. "Import a WPILib 2020 Gradle project" yazmaya başlayın ve aşağıda gösterildiği gibi açılır menüden seçin.

source: You'll be presented with the WPILib Project Importer window. This is similar to the process of creating a new project and the window and the steps are shown below. This window contains the following elements:
tr_tr: WPILib Project Importer penceresi ile karşılaşacaksınız. Bu, yeni bir proje oluşturma sürecine benzer, pencere ve adımlar aşağıda gösterilmiştir. Bu pencere aşağıdaki öğeleri içerir:

source: **Gradle Project**: Selects the project to be imported. Users should select the build.gradle file in the root directory of the gradle project.
tr_tr: **Gradle Project -Gradle Projesi **: İçe aktarılacak projeyi seçer. Kullanıcılar, Gradle projesinin kök dizinindeki build.gradle dosyasını seçmelidir.

source: **Project Location**: This determines the folder in which the robot project will be located.
tr_tr: **Project Location-Proje Konumu**: Robot projesinin konumlandırılacağı klasörü belirler.

source: **Project Name**: The name of the robot project. This also specifies the name that the project folder will be given if the Create New Folder box is checked. This must be a different directory from the original location.
tr_tr: **Project Name-Proje Adı**: Robot projesinin adı. Bu ayrıca "Create New Folder -Yeni Klasör Oluştur" kutusu işaretlendiğinde proje klasörünün verileceği adı da belirtir. Bu, orijinal konumdan farklı bir dizin olmalıdır.

source: **Create a New Folder**: If this is checked, a new folder will be created to hold the project within the previously-specified folder. If it is *not* checked, the project will be located directly in the previously-specified folder. An error will be thrown if the folder is not empty and this is not checked.
tr_tr: ** Create a New Folder-Yeni Klasör Oluştur **: Bu işaretlenirse, projeyi önceden belirtilen klasör içinde tutmak için yeni bir klasör oluşturulur. * not-İşaretli değilse *, proje doğrudan önceden belirtilen klasörde yer alacaktır. Klasör boş değilse ve bu kontrol edilmezse bir hata atılacaktır.

source: **Team Number**: The team number for the project, which will be used for package names within the project and to locate the robot when deploying code.
tr_tr: **Team Number-Takım Numarası**: Proje içindeki paket isimleri için ve kodu yüklerken robotu bulmak için kullanılacak proje takım numarası.

source: **Enable Desktop Support**: If this is checked, simulation and unit test support is enabled. However, there are some cases where this will do some unexpected things. In addition, all vendor libraries need desktop support which not all libraries do.
tr_tr: ** Enable Desktop Support-Masaüstü Desteğini Etkinleştir **: Bu işaretlenirse simülasyon ve birim test desteği etkinleştirilir. Bununla birlikte, bunun bazı beklenmedik şeyler yapacağı bazı durumlar vardır. Ek olarak, tüm kütüphanelerde olmayan tüm satıcı kütüphaneleri masaüstü desteğine ihtiyaç duyar.

source: Click :guilabel:`Import Project` to begin the upgrade.
tr_tr: Yükseltmeye başlamak için :guilabel:`Import Project` a tıklayın.

source: The gradle project will be upgraded and copied into the new project directory. You can then either open the new project immediately (the pop-up shown below should appear in the bottom right) or open it later using the :kbd:`Ctrl+O` (or :kbd:`Command+O` for macOS) shortcut.
tr_tr: Gradle projesi yükseltilecek ve yeni proje dizinine kopyalanacaktır. Daha sonra yeni projeyi hemen açabilir (aşağıda gösterilen açılır pencere sağ altta görünmelidir) veya daha sonra: :kbd:`Ctrl+O` (veya macOS için :kbd:`Command+O` ) kısayol.

source: C++ Configurations (C++ Only)
tr_tr: C++ Yapılandırmaları (Yalnızca C++)

source: For C++ projects, there is one more step to set up IntelliSense. Whenever you open a project, you should get a pop-up in the bottom right corner asking to refresh C++ configurations. Click :guilabel:`Yes` to set up IntelliSense.
tr_tr: C++ projeleri için IntelliSense'i kurmak için bir adım daha vardır. Bir projeyi her açtığınızda, sağ alt köşede C ++ yapılandırmalarını yenilemenizi isteyen bir pencere açmalısınız. IntelliSense'i kurmak için :guilabel:` Yes` seçeneğine tıklayın.

source: 3rd Party Libraries
tr_tr: 3. Şahıs Kütüphaneleri

source: It is necessary to update and re-import 3rd party libraries. See :doc:`3rd Party Libraries <3rd-party-libraries>` for details.
tr_tr: 3. şahıs kütüphanelerinin güncellenmesi ve yeniden içe aktarılması gerekir. Ayrıntılar için :doc:`3rd Party Libraries <3rd-party-libraries>`e bakınız.

source: Manual Import Process (2020 to 2021)
tr_tr: Manual Import Process-Manuel İçe Aktarma Süreci (2020 - 2021)

source: As there were minimal changes to the gradle templates in 2021, it is possible to manually import a project from a 2020 version of GradleRIO to 2021, which may be convenient if you've heavily customized your build.gradle file. This method does *not* work for importing a 2019 project, and will not work for future years. There are two files that need to be updated.
tr_tr: 2021'de gradle şablonlarında çok az değişiklik olduğu için, bir projeyi GradleRIO'nun 2020 sürümünden 2021'e manuel olarak içe aktarmak mümkündür; bu, build.gradle dosyanızı büyük ölçüde özelleştirdiyseniz uygun olabilir. Bu yöntem, bir 2019 projesini içe aktarmak için *çalışmaz* ve gelecek yıllarda çalışmayacaktır. Güncellenmesi gereken iki dosya var.

source: Open ``.wpilib\wpilib_preferences.json`` and change the ``projectYear`` to ``2021``.
tr_tr: ``.wpilib\wpilib_preferences.json`` dosyasını açın ve ``projectYear`` değerini ``2021`` olarak değiştirin.

source: Change the GradleRIO version to the latest version (e.g. 2021.1.2 for the kickoff release)
tr_tr: GradleRIO sürümünü en son sürüme değiştirin (örneğin, başlangıç sürümü için 2021.1.2)

source: (C++ Only) move ``wpi.deps.vendor.cpp(it)`` above ``wpi.deps.wpilib(it)`` (2 places)
tr_tr: (Yalnızca C ++) ``wpi.deps.vendor.cpp (it)`` yi `` wpi.deps.wpilib (it)`` (2 places-yer) üstüne taşı

source: (Optional) add ``simulation wpi.deps.sim.driverstation(wpi.platforms.desktop, XXXX)`` where XXXX is false for Java and true for C++. This allows the driver station to be used in simulation
tr_tr: (İsteğe bağlı) ``simülasyon wpi.deps.sim.driverstation (wpi.platforms.desktop, XXXX)`` ekleyin; burada XXXX, Java için yanlış ve C++ için doğrudur. Bu, sürücü istasyonunun simülasyonda kullanılmasına izin verir

source: (Optional) add the websocket and simulation configuration blocks to support websockets simulation (i.e. Romi)
tr_tr: (İsteğe bağlı) web soketi simülasyonunu (yani Romi) desteklemek için web soketini ve simülasyon yapılandırma bloklarını ekleyin

source: Delete ``imgui.ini`` (the Simulator GUI ini file) if it exists. The 2020 file format is not compatible with the 2021 format. The file will be regenerated when the Simulator GUI is run).
tr_tr: Varsa ``imgui.ini `` (Simulator GUI ini dosyası) dosyasını silin. 2020 dosya formatı, 2021 formatıyla uyumlu değildir. Simülatör GUI çalıştırıldığında dosya yeniden oluşturulacaktır).

source: Update 3rd Party Libraries
tr_tr: 3. Taraf Kitaplıklarını Güncelleyin

source: It is necessary to update 3rd party libraries. See :doc:`3rd Party Libraries <3rd-party-libraries>` for details.
tr_tr: 3. parti kitaplıkların güncellenmesi gereklidir. Ayrıntılar için bkz :doc:`3rd Party Libraries <3rd-party-libraries>`.
