Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/sensors/counters.po
Languages: tr_tr

source: Counters
tr_tr: Counters-Sayıcılar

source: The :code:`Counter` class (`Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Counter.html>`__, `C++ <https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Counter.html>`__) is a versatile class that allows the counting of pulse edges on a digital input. :code:`Counter` is used as a component in several more-complicated WPILib classes (such as :ref:`Encoder <docs/software/sensors/encoders-software:Encoders - Software>` and :ref:`Ultrasonic <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`), but is also quite useful on its own.
tr_tr: The :code: `Counter` sınıfı (` Java <https://first.wpi.edu/wpilib/allwpilib/docs/release/java/edu/wpi/first/wpilibj/Counter.html> `__,` C ++ < https://first.wpi.edu/wpilib/allwpilib/docs/release/cpp/classfrc_1_1Counter.html>`__), dijital bir girişte darbe kenarlarının sayılmasına izin veren çok yönlü bir sınıftır. :code:`Counter` is used as a component in several more-complicated WPILib classes (such as :ref:`Encoder <docs/software/sensors/encoders-software:Encoders - Software>` and :ref:`Ultrasonic <docs/software/sensors/ultrasonics-software:Ultrasonics - Software>`), ancak kendi başına da oldukça kullanışlıdır.

source: There are a total of 8 counter units in the roboRIO FPGA, meaning no more than 8 :code:`Counter` objects may be instantiated at any one time, including those contained as resources in other WPILib objects. For detailed information on when a :code:`Counter` may be used by another object, refer to the official API documentation.
tr_tr: RoboRIO FPGA'da toplam 8 counter birimi vardır, yani 8'den fazla olamaz :code:`Counter` nesneleri, diğer WPILib nesnelerinde kaynaklar olarak bulunanlar da dahil olmak üzere herhangi bir zamanda başlatılabilir. A :code:`Counter` ın başka bir nesne tarafından ne zaman kullanılabileceğine ilişkin ayrıntılı bilgi için, resmi API belgelerine bakın.

source: Configuring a counter
tr_tr: Sayıcıyı Yapılandırma

source: The :code:`Counter` class can be configured in a number of ways to provide differing functionalities.
tr_tr: :code:`Counter` sınıfı, farklı işlevler sağlamak için çeşitli şekillerde yapılandırılabilir.

source: Counter Modes
tr_tr: Counter-Sayıcı Modları

source: The :code:`Counter` object may be configured to operate in one of four different modes:
tr_tr: :code:`Counter` nesnesi, dört farklı moddan birinde çalışacak şekilde yapılandırılabilir:

source: `Two-pulse mode`_: Counts up and down based on the edges of two different channels.
tr_tr: `Two-pulse mode`_: İki farklı kanalın kenarlarına göre yukarı ve aşağı sayar.

source: `Semi-period mode`_: Measures the duration of a pulse on a single channel.
tr_tr: `Semi-period mode`_: Tek bir kanaldaki bir darbenin süresini ölçer.

source: `Pulse-length mode`_: Counts up and down based on the edges of one channel, with the direction determined by the duration of the pulse on that channel.
tr_tr: `Pulse-length mode`_ Yön, kanaldaki darbenin süresine göre belirlenen kanalın kenarlarına göre yukarı ve aşağı sayar.

source: `External direction mode`_: Counts up and down based on the edges of one channel, with a separate channel specifying the direction.
tr_tr: `External direction mode`_: Yönü ayrı bir kanal belirleyerek, bir kanalın kenarlarına göre yukarı ve aşağı sayar.

source: In all modes except semi-period mode, the counter can be configured to increment either once per edge (2X decoding), or once per pulse (1X decoding). By default, counters are set to two-pulse mode, if only one channel is specified, the counter will only count up.
tr_tr: Yarı dönem modu dışındaki tüm modlarda, sayaç, kenar başına bir kez (2X kod çözme) veya darbe başına bir kez (1X kod çözme) artacak şekilde yapılandırılabilir. Varsayılan olarak, sayaçlar iki darbeli moda ayarlanmıştır, yalnızca bir kanal belirtilirse, sayaç yalnızca sayar.

source: Two-pulse mode
tr_tr: Two-pulse İki darbeli mod

source: In two-pulse mode, the :code:`Counter` will count up for every edge/pulse on the specified "up channel," and down for every edge/pulse on the specified "down channel." A counter can be initialized in two-pulse with the following code:
tr_tr: İki darbeli modda, :code:`Counter` belirtilen "up channel" üzerindeki her kenar / darbe için ve belirtilen "down channel" üzerindeki her kenar/darbe için aşağı doğru sayacaktır. Bir sayaç, aşağıdaki kodla iki darbeli olarak başlatılabilir:

source: Semi-period mode
tr_tr: Semi-period Yarı dönem modu

source: In semi-period mode, the :code:`Counter` will count the duration of the pulses on a channel, either from a rising edge to the next falling edge, or from a falling edge to the next rising edge. A counter can be initialized in semi-period mode with the following code:
tr_tr: Yarı dönem modunda :code:`Counter", bir kanaldaki darbelerin süresini yükselen kenardan bir sonraki düşen kenara veya düşen kenardan bir sonraki yükselen kenara sayacaktır. Bir sayaç, aşağıdaki kodla semi-period - yarı dönem modunda başlatılabilir:

source: To get the pulse width, call the :code:`getPeriod()` method:
tr_tr: Darbe genişliğini elde etmek için :code:`getPeriod()` yöntemini çağırın:

source: Pulse-length mode
tr_tr: Pulse uzunluğu - Pulse-length modu

source: In pulse-length mode, the counter will count either up or down depending on the length of the pulse. A pulse below the specified threshold time will be interpreted as a forward count and a pulse above the threshold is a reverse count. This is useful for some gear tooth sensors which encode direction in this manner. A counter can be initialized in this mode as follows:
tr_tr: Darbe uzunluğu modunda, sayaç darbenin uzunluğuna bağlı olarak yukarı veya aşağı sayacaktır. Belirtilen eşik süresinin altındaki bir darbe ileri bir sayı olarak yorumlanacaktır ve eşiğin üzerindeki bir darbe bir ters sayımdır. Bu, yönü bu şekilde kodlayan bazı dişli dişi sensörleri için kullanışlıdır. Bu modda bir sayaç aşağıdaki şekilde başlatılabilir:

source: External direction mode
tr_tr: Dış yön modu

source: In external direction mode, the counter counts either up or down depending on the level on the second channel. If the direction source is low, the counter will increase, if the direction source is high, the counter will decrease (to reverse this, see the next section). A counter can be initialized in this mode as follows:
tr_tr: Harici yön modunda, ikinci kanaldaki seviyeye bağlı olarak sayaç yukarı veya aşağı sayar. Yön kaynağı düşükse sayaç artacaktır, yön kaynağı yüksekse sayaç azalacaktır (bunu tersine çevirmek için sonraki bölüme bakın). Bu modda bir sayaç aşağıdaki şekilde başlatılabilir:

source: Configuring counter parameters
tr_tr: Sayaç-counter parametrelerini yapılandırma

source: The :code:`Counter` class does not make any assumptions about units of distance; it will return values in whatever units were used to calculate the distance-per-pulse value. Users thus have complete control over the distance units used. However, units of time are *always* in seconds.
tr_tr: :code:`Counter` sınıfı, mesafe birimleri hakkında herhangi bir varsayımda bulunmaz; darbe başına mesafe değerini hesaplamak için kullanılan birimlerdeki değerleri döndürür. Kullanıcılar böylece kullanılan mesafe birimleri üzerinde tam kontrole sahip olur. Ancak, zaman birimleri * her zaman * saniye cinsindendir.

source: The number of pulses used in the distance-per-pulse calculation does *not* depend on the decoding type - each "pulse" should always be considered to be a full cycle (rising and falling).
tr_tr: Darbe başına mesafe hesaplamasında kullanılan darbe sayısı, kod çözme türüne bağlı * değildir * - her "darbe" her zaman tam bir döngü (yükselen ve düşen) olarak düşünülmelidir.

source: Apart from the mode-specific configurations, the :code:`Counter` class offers a number of additional configuration methods:
tr_tr: Moda özgü konfigürasyonların yanı sıra :code:`Counter` sınıfı bir dizi ek yapılandırma yöntemi sunar:

source: Reading information from counters
tr_tr: Sayaçlardan bilgi okuma

source: Regardless of mode, there is some information that the :code:`Counter` class always exposes to users:
tr_tr: Moddan bağımsız olarak, :code:`Counter` sınıfının her zaman kullanıcılara sunduğu bazı bilgiler vardır:

source: Count
tr_tr: Count - Sayım

source: Users can obtain the current count with the :code:`get()` method:
tr_tr: Kullanıcılar şu anki sayımı :code:`get()` yöntemiyle alabilir:

source: Distance
tr_tr: Distance-Distance

source: Counters measure *relative* distance, not absolute; the distance value returned will depend on the position of the encoder when the robot was turned on or the encoder value was last :ref:`reset <docs/software/sensors/counters:Resetting a Counter>`.
tr_tr: Sayaçlar *relative-göreli* mesafeyi ölçer, mutlak değil; döndürülen mesafe değeri, robot açıldığında veya kodlayıcı değeri en son olduğunda kodlayıcının konumuna bağlı olacaktır :ref:`reset<docs/software/sensors/counters:Resetting a Counter>`.

source: If the :ref:`distance per pulse <docs/software/sensors/counters:Configuring counter parameters>` has been configured, users can obtain the total distance traveled by the counted sensor with the :code:`getDistance()` method:
tr_tr: :ref:`darbe başına mesafe <docs/software/sensors/counters:Configuring counter parameters>` yapılandırılmışsa, kullanıcılar sayılan sensörün kat ettiği toplam mesafeyi :code:`getDistance()` yöntemiyle elde edebilir:

source: Rate
tr_tr: Rate-Oran

source: Units of time for the :code:`Counter` class are *always* in seconds.
tr_tr: :code:`Counter` sınıfı için zaman birimleri saniye cinsinden *her zaman* şeklindedir.

source: Users can obtain the current rate of change of the counter with the :code:`getRate()` method:
tr_tr: Kullanıcılar şu anki sayacın değişim oranını :code:`getRate()` yöntemi ile elde edebilir:

source: Stopped
tr_tr: Stopped-Durdurulmuş

source: Users can obtain whether the counter is stationary with the :code:`getStopped()` method:
tr_tr: Kullanıcılar, sayacın sabit olup olmadığını :code:`getStopped()` yöntemiyle öğrenebilirler:

source: Direction
tr_tr: Direction - Yön

source: Users can obtain the direction in which the counter last moved with the :code:`getDirection()` method:
tr_tr: Kullanıcılar, sayıcının en son hareket ettiği yönü :code:`getDirection()' yöntemiyle elde edebilir:

source: In :ref:`semi-period mode <docs/software/sensors/counters:Semi-period mode>`, this method returns the duration of the pulse, not of the period.
tr_tr: :ref:`semi-period modu<docs/software/sensors/counters:Semi-period mode>`, bu yöntem peryodu değil, darbenin süresini döndürür.

source: Users can obtain the duration (in seconds) of the most-recent period with the :code:`getPeriod()` method:
tr_tr: Kullanıcılar, en son dönemin süresini (saniye cinsinden ):code:`getPeriod()` yöntemiyle elde edebilir:

source: Resetting a counter
tr_tr: Sayıcıyı sıfırlama

source: To reset a counter to a distance reading of zero, call the :code:`reset()` method. This is useful for ensuring that the measured distance corresponds to the actual desired physical measurement.
tr_tr: Bir sayacı sıfır mesafeli okumaya sıfırlamak için :code:`reset()` yöntemini çağırın. Bu, ölçülen mesafenin gerçek istenen fiziksel ölçüme karşılık gelmesini sağlamak için kullanışlıdır.

source: Using counters in code
tr_tr: Counter-Sayıcı ları kodda kullanma

source: Counters are useful for a wide variety of robot applications - but since the :code:`Counter` class is so varied, it is difficult to provide a good summary of them here. Many of these applications overlap with the :code:`Encoder` class - a simple counter is often a cheaper alternative to a quadrature encoder. For a summary of potential uses for encoders in code, see :ref:`docs/software/sensors/encoders-software:Encoders - Software`.
tr_tr: Sayaçlar çok çeşitli robot uygulamaları için kullanışlıdır - ancak :code:`Counter` sınıfı çok çeşitli olduğundan burada bunların iyi bir özetini vermek zordur. Bu uygulamaların çoğu :code:`Encoder` sınıfı ile örtüşmektedir - basit bir sayaç, genellikle bir quadrature kodlayıcıya göre daha ucuz bir alternatiftir. Koddaki kodlayıcıların potansiyel kullanımlarının bir özeti için bkz . :ref:`docs/software/sensors/encoders-software:Encoders - Software`.
