Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/software/wpilib-tools/robot-simulation/simulation-gui.po
Languages: tr_tr

source: Simulation User Interface
tr_tr: Simülasyon Kullanıcı Arayüzü

source: WPILib has extended robot simulation to introduce a graphical user interface (GUI) component. This allows teams to easily visualize their robot's inputs and outputs.
tr_tr: WPILib, bir grafik kullanıcı arabirimi (GUI) bileşeni sunmak için genişletilmiş robot simülasyonuna sahiptir. Bu, ekiplerin robotlarının girdilerini ve çıktılarını kolayca görselleştirmesine olanak tanır.

source: Running the GUI
tr_tr: GUI'yi çalıştırma

source: You can simply launch the GUI via the **Run Simulation** command palette option.
tr_tr: GUI'yi **Run Simulation** komut paleti seçeneğiyle başlatabilirsiniz.

source: And the ``halsim_gui.dll`` option should popup in a new dialog (``halsim.gui.so`` on Linux and ``halsim_gui.dylib`` on macOS). Select this and press **Ok**. This will now launch the Simulation GUI!
tr_tr: Ve ``halsim_gui.dll`` seçeneği yeni bir iletişim kutusunda açılır (Linux'ta ``halsim.gui.so`` ve macOS'ta ``halsim_gui.dylib``). Bunu seçin ve **Ok-Tamam * tuşuna basın. Bu şimdi Simulation GUI'yi başlatacak!

source: Using the GUI
tr_tr: GUI'yi kullanma

source: Learning the Layout
tr_tr: Düzeni Öğrenmek

source: The following items are shown on the simulation GUI by default:
tr_tr: Aşağıdaki öğeler simülasyon GUI'sinde varsayılan olarak gösterilir:

source: **Robot State** - This is the robot's current state or "mode". You can click on the labels to change mode as you would on the normal Driver Station.
tr_tr: **Robot State** - Bu, robotun mevcut durumu veya "modudur". Normal Driver Station'da yaptığınız gibi modu değiştirmek için etiketlere tıklayabilirsiniz.

source: **Timing** - Shows the values of the Robot's timers and allows the timing to be manipulated.
tr_tr: **Timing-Zamanlama** - Robotun zamanlayıcılarının değerlerini gösterir ve zamanlamanın değiştirilmesine izin verir.

source: **System Joysticks** - This is a list of joysticks connected to your system currently.
tr_tr: **System Joysticks** - Bu, şu anda sisteminize bağlı kumanda çubuklarının bir listesidir.

source: **FMS** - This is used for simulating many of the common FMS systems.
tr_tr: **FMS** - Bu, yaygın FMS sistemlerinin çoğunu simüle etmek için kullanılır.

source: **NetworkTables** - This shows the data that has been published to NetworkTables.
tr_tr: **NetworkTables** - Bu, NetworkTables'da yayınlanan verileri gösterir.

source: **Joysticks** - This is joysticks that the robot code can directly pull from.
tr_tr: **Joysticks** - Bu, robot kodunun doğrudan çekebileceği joysticklerdir.

source: **Other Devices** - This includes devices that do not fall into any of the other categories, such as the ADXRS450 gyro that is included in the Kit of Parts or third party devices that support simulation.
tr_tr: **Other Devices-Diğer Cihazlar** - Bu, Parça Kitine dahil olan ADXRS450 cayro veya simülasyonu destekleyen üçüncü taraf cihazlar gibi diğer kategorilerin hiçbirine girmeyen cihazları içerir.

source: The following items can be added from the Hardware menu, but are not shown by default.
tr_tr: Aşağıdaki öğeler Donanım menüsünden eklenebilir ancak varsayılan olarak gösterilmez.

source: **Addressable LEDs** - This shows LEDs controlled by the ``AddressableLED`` Class.
tr_tr: **Addressable LEDs-Adreslenebilir LED'ler ** - Bu, ``AddressableLED`` Sınıfı tarafından kontrol edilen LED'leri gösterir.

source: **Analog Inputs** - This includes any devices that would normally use the **ANALOG IN** connector on the roboRIO, such as any Analog based gyros.
tr_tr: **Analog Inputs** - Bu, Analog tabanlı jiroskoplar gibi normalde roboRIO'da **ANALOG IN** konektörünü kullanan tüm cihazları içerir.

source: **DIO** - (Digital Input Output) This includes any devices that use the **DIO** connector on the roboRIO.
tr_tr: **DIO** - (Dijital Giriş Çıkışı) Bu, roboRIO'da **DIO** konektörünü kullanan tüm cihazları içerir.

source: **Encoders** - This will show any instantiated devices that extend or use the ``Encoder`` class.
tr_tr: **Encoders** - Bu, ``Encoder`` sınıfını genişleten veya kullanan tüm somutlaştırılmış cihazları gösterecektir.

source: **PDPs** - This shows the Power Distribution Panel object.
tr_tr: **PDPs-PDP'ler** - Bu, Power Distribution Panel nesnesini gösterir.

source: **PWM Outputs** - This is a list of instantiated PWM devices. This will appear as many devices as you instantiate in robot code, as well as their outputs.
tr_tr: **PWM Outputs** - Bu, somutlaştırılmış PWM cihazlarının listesidir. Bu, robot kodunda ve çıktılarında örneklediğiniz kadar çok cihaz görünecektir.

source: **Relays** - This includes any relay devices. This includes VEX Spike relays.
tr_tr: **Relays** - Bu, tüm röle cihazlarını içerir. Buna VEX Spike röleleri dahildir.

source: **Solenoids** - This is a list of "connected" solenoids. When you create a solenoid object and push outputs, these are shown here.
tr_tr: **Solenoids** - Bu, "connected" solenoidlerin bir listesidir. Bir solenoid nesne oluşturduğunuzda ve çıkışları ittiğinizde, bunlar burada gösterilir.

source: Adding a System Joystick to Joysticks
tr_tr: Kumanda Çubuklarına System Kumanda Çubuğu Ekleme

source: To add a joystick from the list of system joysticks, simply click and drag a shown joystick under the "System Joysticks" menu to the "Joysticks" menu".
tr_tr: Sistem kumanda çubukları listesinden bir kumanda çubuğu eklemek için, "System Joysticks" menüsü altında gösterilen bir kumanda çubuğuna tıklayıp "Joysticks" menüsüne sürükleyin.

source: The FRC\ |reg| Driver Station does special mapping to gamepads connected and the WPILib simulator does not "map" these by default. You can turn on this behavior by pressing the "Map gamepad" toggle underneath the "Joysticks" menu.
tr_tr: FRC \ |reg| Driver Station, bağlı oyun kumandalarına özel eşleme yapar ve WPILib simülatörü bunları varsayılan olarak "eşleme" yapmaz. Bu davranışı, "Joysticks" menüsünün altındaki "Map gamepad-Harita oyun kumandası" geçiş düğmesine basarak etkinleştirebilirsiniz.

source: Modifying ADXRS450 Inputs
tr_tr: ADXRS450 Girişlerini Değiştirme

source: Using the ADXRS450 object is a fantastic way to test gyro based outputs. This will show up in the "Other Devices" menu. A drop down menu is then exposed that shows various options such as "Connected", "Angle", and "Rate". All of these values are values that you can change, and that your robot code and use on-the-fly.
tr_tr: ADXRS450 nesnesini kullanmak, cayro tabanlı çıktıları test etmenin harika bir yoludur. Bu, "Orher Devices" menüsünde görünecektir. Daha sonra "Connected", "Angle" ve "Rate" gibi çeşitli seçenekleri gösteren bir açılır menü ortaya çıkar. Bu değerlerin tümü, değiştirebileceğiniz ve robotunuzun anında kodlayıp kullandığı değerlerdir.

source: Determining Simulation from Robot Code
tr_tr: Robot Kodundan Simülasyonu Belirleme

source: In cases where vendor libraries do not compile when running the robot simulation, you can wrap their content with ``RobotBase.isReal()`` which returns a ``boolean``.
tr_tr: Üretici kitaplıklarının robot simülasyonunu çalıştırırken derlenmediği durumlarda, içeriklerini bir ``boolean`` döndüren ``RobotBase.isReal ()`` ile kapsayabilirsiniz.

source: Reassigning value types in C++ requires move or copy assignment; vendors classes that both do not support the SIM and lack a move or copy assignment operator cannot be worked around with conditional allocation unless a pointer is used, instead of a value type.
tr_tr: C++ 'da değer türlerini yeniden atamak, taşıma veya kopyalama ataması gerektirir; Hem SIM'i desteklemeyen hem de taşıma veya kopyalama atama operatörü olmayan üretici sınıfları, bir değer türü yerine bir işaretçi kullanılmadıkça koşullu tahsis ile çalışılamaz.

source: Viewing the Robot Pose
tr_tr: Robot Duruşunu Görüntüleme

source: After sending the ``Field2d`` instance over NetworkTables, the :guilabel:`Field2d` widget can be added to the simulation GUI by selecting :guilabel:`NetworkTables` in the menu bar, choosing the table name that the instance was sent over, and then clicking on the :guilabel:`Field` button.
tr_tr: ``Field2d`` örneğini NetworkTables üzerinden gönderdikten sonra, :guilabel:`Field2d` widget'ı, menü çubuğunda :guilabel:` NetworkTables 'seçilerek, örneğin gönderildiği tablo adını seçerek simülasyon GUI'sine eklenebilir. ve ardından :guilabel:`Field` butonuna tıklayın.

source: Once the widget appears, you can resize and place it on the simulation GUI workspace as you desire. Right-clicking the top of the widget will allow you to customize the name of the widget, select a custom field image, select a custom robot image, and choose the dimensions of the field and robot.
tr_tr: Widget göründüğünde, onu yeniden boyutlandırabilir ve istediğiniz gibi simülasyon GUI çalışma alanına yerleştirebilirsiniz. Widget'ın üst kısmına sağ tıklamak, widget'ın adını özelleştirmenize, özel bir alan görüntüsü seçmenize, özel bir robot görüntüsü seçmenize ve alan ile robotun boyutlarını seçmenize olanak tanır.

source: When selecting :guilabel:`Choose image...` you can choose to either select an image file or a PathWeaver JSON file as long as the image file is in the same directory. Choosing the JSON file will automatically import the correct location of the field in the image and the correct size of the field.
tr_tr: Seçerken :guilabel:`Choose image...` resim dosyası aynı dizinde olduğu sürece bir resim dosyası veya bir PathWeaver JSON dosyası seçmeyi seçebilirsiniz. JSON dosyasının seçilmesi, görüntüdeki alanın doğru konumunu ve alanın doğru boyutunu otomatik olarak içe aktaracaktır.

source: You can retrieve the latest field image and JSON files from `here <https://github.com/wpilibsuite/PathWeaver/tree/master/src/main/resources/edu/wpi/first/pathweaver>`__. This is the same image and JSON that are used when generating paths using :ref:`PathWeaver <docs/software/wpilib-tools/pathweaver/introduction:Introduction to PathWeaver>`.
tr_tr: En son alan görüntüsünü ve JSON dosyalarını `here <https://github.com/wpilibsuite/PathWeaver/tree/master/src/main/resources/edu/wpi/first/pathweaver>`__ adresinden alabilirsiniz. Bu, şunu kullanarak yollar oluştururken kullanılan aynı görüntü ve JSON'dur :ref:`PathWeaver <docs/software/wpilib-tools/pathweaver/introduction:Introduction to PathWeaver>`.
