Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/controls-overviews/control-system-hardware.po
Languages: es_mx

source: The Microsoft Lifecam HD3000 is a USB webcam that can be plugged directly into the roboRIO. The camera is capable of capturing up to 1280x720 video at 30 FPS. For more information about the camera, see the `Microsoft product page <https://www.microsoft.com/accessories/en-us/business/lifecam-hd-3000-for-business/t4h-00002>`__. For more information about using the camera with the roboRIO, see the :ref:`Vision Processing <docs/software/vision-processing/index:Vision Processing>` section of this documentation.
es_mx: La Microsoft Lifecam HD3000 es una cámara web USB que se puede conectar directamente al roboRIO. La cámara es capaz de capturar videos de hasta 1280x720 a 30 FPS. Para obtener más información sobre la cámara, consulte la `página de producto de Microsoft <https://www.microsoft.com/accessories/en-us/business/lifecam-hd-3000-for-business/t4h-00002>` __. Para obtener más información sobre el uso de la cámara con roboRIO, consulte la sección: ref: `Vision Processing <docs/software/vision-processing/index:Vision Processing>` de esta documentación.

source: Image Credits
es_mx: Créditos de imagen
