Repository: Daltz333/frc-docs-translations
Catalog: locale/*/LC_MESSAGES/docs/controls-overviews/control-system-hardware.po
Languages: es_mx

source: Hardware Component Overview
es_mx: Descripción general de los componentes de Hardware

source: The goal of this document is to provide a brief overview of the hardware components that make up the FRC\ |reg| Control System. Each component will contain a brief description of the component function and a link to more documentation.
es_mx: El objetivo de este documento es proporcionar una breve descripción de los componentes del hardware que componen el Sistema de Control FRC\ |reg|. Cada componente contendrá una breve descripción de la función del componente y un enlace a más documentación.

source: For complete wiring instructions/diagrams, please see the :doc:`Wiring the FRC Control System </docs/zero-to-robot/step-1/how-to-wire-a-robot>` document.
es_mx: Para obtener instrucciones / diagramas de cableado completos, consulte el documento: doc: `Wiring the FRC Control System </docs/zero-to-robot/step-1/how-to-wire-a-robot>`.

source: Overview of Control System
es_mx: Descripción general del Sistema de Control

source: Diagram courtesy of FRC Team 3161 and Stefen Acepcion.
es_mx: Diagrama cortesía de FRC Team 3161 y Stefen Acepcion.

source: The :ref:`NI-roboRIO <docs/software/roborio-info/roborio-introduction:roboRIO Introduction>` is the main robot controller used for FRC. The roboRIO serves as the "brain" for the robot running team-generated code that commands all of the other hardware.
es_mx: El :ref:`NI-roboRIO <docs/software/roborio-info/roborio-introduction:roboRIO Introduction> `es el controlador de robot principal utilizado para FRC. El roboRIO sirve como el "cerebro" del robot que ejecuta un código generado por el equipo que controla todo el resto del hardware.

source: The :ref:`Power Distribution Panel <docs/software/can-devices/power-distribution-panel:Power Distribution Panel>` (PDP) is designed to distribute power from a 12VDC battery to various robot components through auto-resetting circuit breakers and a small number of special function fused connections. The PDP provides 8 output pairs rated for 40A continuous current and 8 pairs rated for 30A continuous current. The PDP provides dedicated 12V connectors for the roboRIO, as well as connectors for the Voltage Regulator Module and Pneumatics Control Module. It also includes a CAN interface for logging current, temperature, and battery voltage. For more detailed information, see the `PDP User Manual <https://www.ctr-electronics.com/downloads/pdf/PDP%20User's%20Guide.pdf>`__.
es_mx: El :ref:`Power Distribution Panel <docs/software/can-devices/power-distribution-panel:Power Distribution Panel>` (PDP) está diseñado para distribuir energía desde una batería de 12VDC a varios componentes del robot a través de circuitos de reinicio automático y un pequeño número de conexiones fusionadas con una función especial. El PDP proporciona 8 pares de salida clasificados por corriente continua de 40A y 8 pares clasificados por corriente continua de 30A. El PDP proporciona conectores dedicados para la roboRIO de 12V, así como conectores pare el Módulo Regulador de Voltaje y el Módulo de Control Neumático. También incluye una interfaz CAN para corriente de registro, temperatura, y voltaje de la batería. Para más información detallada, vea el `Manual de Usuario del PDP <https://www.ctr-electronics.com/downloads/pdf/PDP%20User's%20Guide.pdf>`__.

source: The Voltage Regulator Module (VRM) is an independent module that is powered by 12 volts. The device is wired to a dedicated connector on the PDP. The module has multiple regulated 12V and 5V outputs. The purpose of the VRM is to provide regulated power for the robot radio, custom circuits, and IP vision cameras. For more information, see the `VRM User Manual <https://www.ctr-electronics.com/VRM%20User's%20Guide.pdf>`__.
es_mx: El Modulo Regulador de Voltaje (VRM) es un modulo independiente que funciona con 12 Voltios. El dispositivo está cableado a un conector dedicado de la PDP. El modulo tiene múltiples salidas reguladas en 12V y 5V. El propósito de la VRM es proveer potencia regulada para la radio del robot, circuitos personalizados, y cámaras IP dedicadas a visión. Para más información, vea el `VRM User Manual <https://www.ctr-electronics.com/VRM%20User's%20Guide.pdf>`__.

source: OpenMesh OM5P-AN or OM5P-AC Radio
es_mx: Radio OpenMesh OM5P-AN o OM5P-AC

source: Either the OpenMesh OM5P-AN or `OpenMesh OM5P-AC <https://www.openmesh.com/resource-downloads/OM-Series-Datasheet.pdf>`__ wireless radio is used as the robot radio to provide wireless communication functionality to the robot. The device can be configured as an Access Point for direct connection of a laptop for use at home. It can also be configured as a bridge for use on the field. The robot radio should be powered by one of the 12V/2A outputs on the VRM and connected to the roboRIO controller over Ethernet. For more information, see :ref:`Programming your Radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.
es_mx: La radio inalámbrica OpenMesh OM5P-AN u OpenMesh OM5P-AC <https://www.openmesh.com/resource-downloads/OM-Series-Datasheet.pdf> __ se utiliza como radio del robot para proporcionar funcionalidad de comunicación inalámbrica al robot. El dispositivo se puede configurar como un punto de acceso para la conexión directa de una computadora portátil para usar en casa. También se puede configurar como puente para su uso en el campo. La radio del robot debe ser alimentada por una de las salidas de 12V / 2A en el VRM y conectada al controlador roboRIO a través de Ethernet. Para obtener más información, consulte :ref:`Programming your Radio <docs/zero-to-robot/step-3/radio-programming:Programming your Radio>`.

source: The OM5P-AN `is no longer available for purchase <https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__. The OM5P-AC is slightly heavier, has more cooling grates, and has a rough surface texture compared to the OM5P-AN.
es_mx: La OM5P-AN `no esta disponible para su compra <https://www.firstinspires.org/robotics/frc/blog/radio-silence>`__. La OM5P-AC es un poco más pesada, tiene más rejillas de ventilación, y tiene una superficie más áspera en comparación a la OM5P-AN.

source: 120A Circuit Breaker
es_mx: Interruptor de circuito 120A

source: The 120A Main Circuit Breaker serves two roles on the robot: the main robot power switch and a protection device for downstream robot wiring and components. The 120A circuit breaker is wired to the positive terminals of the robot battery and Power Distribution boards. For more information, please see the `Cooper Bussmann 18X Series Datasheet (PN: 185120F) <https://www.mouser.com/datasheet/2/87/BUS_Tns_DS_18X_CIRCUITBREAKER-515519.pdf>`__
es_mx: El interruptor de circuito de 120A cumple dos funciones en el robot: el interruptor de alimentación principal del robot y un dispositivo de protección para el cableado y los componentes del robot después de este. El interruptor de 120A está conectado a los terminales positivos de la batería del robot y a los tableros de distribución de energía. Para obtener más información, consulte la `Cooper Bussmann 18X Series Datasheet (PN: 185120F) <https://www.mouser.com/datasheet/2/87/BUS_Tns_DS_18X_CIRCUITBREAKER-515519.pdf>`__

source: Snap Action Circuit Breakers
es_mx: Interruptores de circuito de acción inmediata

source: The Snap Action circuit breakers, `MX5 series <http://www.snapaction.net/pdf/MX5%20Spec%20Sheet.pdf>`__ and `VB3 Series <http://www.snapaction.net/pdf/vb3.pdf>`__, are used with the Power Distribution Panel to limit current to branch circuits. The ratings on these circuit breakers are for continuous current, temporary peak values can be considerably higher.
es_mx: Los interruptores de circuito de acción inmediata, `MX5 series <http://www.snapaction.net/pdf/MX5%20Spec%20Sheet.pdf>`__ y `VB3 Series <http://www.snapaction.net/pdf/vb3.pdf>`__, son usados con el Panel de Distribución de Poder para limitar la corriente a los circuitos derivados. Los valores nominales de estos interruptores de circuito son para corriente continua, los picos de valor temporales pueden ser considerablemente más altos.

source: Robot Battery
es_mx: Batería del robot

source: The power supply for an FRC robot is a single 12V 18Ah battery. The batteries used for FRC are sealed lead acid batteries capable of meeting the high current demands of an FRC robot. For more information, see the datasheet for the `MK ES17-12 <https://www.mkbattery.com/application/files/2515/3308/8109/ES17-12.pdf>`__.
es_mx: La fuente de alimentación de un robot FRC es una sola batería de 12V 18 Ah. Las baterías utilizadas para FRC son baterías de plomo ácido selladas capaces de satisfacer las altas demandas actuales de un robot FRC. Para obtener más información, consulte la hoja de datos del `MK ES17-12 <https://www.mkbattery.com/application/files/2515/3308/8109/ES17-12.pdf>` __.

source: Other battery part numbers may be legal, consult the `FRC Manual <https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>`__ for a complete list.
es_mx: Otros números de pieza de batería pueden ser legales; consulte el `Manual de FRC <https://www.firstinspires.org/resource-library/frc/competition-manual-qa-system>` __ para obtener una lista completa.

source: Robot Signal Light
es_mx: Luz de Señal del Robot

source: The Robot Signal Light (RSL) is required to be the Allen-Bradley 855PB-B12ME522. It is directly controlled by the roboRIO and will flash when enabled and stay solid while disabled.
es_mx: La Luz de Señal del Robot (RSL) se requiere que sea la Allen-Bradley 855PB-B12ME522. Esta es directamente controlada por la roboRIO y parpadeará cuando el robot esté habilitado y se mantendrá solida cuando esté deshabilitado.

source: The :ref:`Pneumatics Control Module <docs/software/can-devices/pneumatics-control-module:Pneumatics Control Module>` (PCM) contains all of the inputs and outputs required to operate 12V or 24V pneumatic solenoids and the on board compressor. The PCM contains an input for the pressure sensor and will control the compressor automatically when the robot is enabled and a solenoid has been created in the code. For more information see the `PCM User Manual <https://www.ctr-electronics.com/downloads/pdf/PCM%20User's%20Guide.pdf>`__.
es_mx: El :ref:`Modulo Controlador de Neumática <docs/software/can-devices/pneumatics-control-module:Pneumatics Control Module>` (PCM) contiene todas las entradas y salidas necesarias para operar solenoides neumáticos de 12V o 24V y el compresor abordo. El PCM contiene una entrada para el sensor de presión y controlará el compresor automáticamente cuando el robot se habilite y el solenoide haya sido creado en el código. Para más información vea el `PCM User Manual <https://www.ctr-electronics.com/downloads/pdf/PCM%20User's%20Guide.pdf>`__.

source: Motor Controllers
es_mx: Controladores de motor

source: There are a variety of different :ref:`motor controllers <docs/software/actuators/overview:Actuator Overview>` which work with the FRC Control System and are approved for use. These devices are used to provide variable voltage control of the brushed and brushless DC motors used in FRC. They are listed here in order of `usage <https://www.firstinspires.org/robotics/frc/blog/2021-beta-testing-usage-report>`__.
es_mx: Hay variedad de diferentes :ref:`controladores de motor <docs/software/actuators/overview:Actuator Overview>` que funcionan en el Sistema de Control de FRC y están aprobados para su uso. Estos dispositivos son usados para proveer un control variable del voltaje de los motores de corriente continua con o sin escobillas usados en FRC. Estos son usados en orden de `uso <https://www.firstinspires.org/robotics/frc/blog/2021-beta-testing-usage-report>`__.

source: 3rd Party CAN control is not supported from WPILib. See this section on :ref:`docs/software/can-devices/third-party-devices:Third-Party CAN Devices` for more information.
es_mx: El control CAN de terceros no es compatible con WPILib. Consulte esta sección en :ref:`docs/software/can-devices/third-party-devices:Third-Party CAN Devices` para obtener más información.

source: The `Talon SRX Motor Controller <https://www.ctr-electronics.com/talon-srx.html>`__ is a “smart motor controller” from Cross The Road Electronics/VEX Robotics. The Talon SRX can be controlled over the CAN bus or PWM interface. When using the CAN bus control, this device can take inputs from limit switches and potentiometers, encoders, or similar sensors in order to perform advanced control. For more information see the `Talon SRX User's Guide <http://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__.
es_mx: El `Controlador de motor Talon SRX <https://www.ctr-electronics.com/talon-srx.html>`__ es un "controlador de motor inteligente" de Cross The Road Electronics/VEX Robotics. El Talon SRX puede ser controlado a través de CAN o una interfaz PWM. Cuando se usa el control CAN, este dispositivo puede obtener entradas de limit switches y potenciómetros, encoders, o sensores similares para llevar a cabo control avanzado, para más información vea la `Talon SRX User's Guide <http://www.ctr-electronics.com/Talon%20SRX%20User's%20Guide.pdf>`__.

source: Victor SPX
es_mx: Víctor SPX

source: The `Victor SPX Motor Controller <http://www.ctr-electronics.com/control-system/motor-control/victor-spx.html>`__ is a CAN or PWM controlled motor controller from Cross The Road Electronics/VEX Robotics. The device is connectorized to allow easy connection to the roboRIO PWM connectors or a CAN bus. The case is sealed to prevent debris from entering the controller. For more information, see the `Victor SPX User Guide <http://www.ctr-electronics.com/downloads/pdf/Victor%20SPX%20User's%20Guide.pdf>`__.
es_mx: El `Controlador de Motor Victor SPX <http://www.ctr-electronics.com/control-system/motor-control/victor-spx.html>`__ es un controlador de motor controlado por PWM o CAN de Cross The Road Electronics/VEX Robotics. El dispositivo está conectorizado para permitir una conexión fácil a los conectores PWM o CAN de la roboRIO. La caja está sellada para prevenir la entrada de residuos al controlador. Para más información, vea el `Victor SPX User Guide <http://www.ctr-electronics.com/downloads/pdf/Victor%20SPX%20User's%20Guide.pdf>`__.

source: SPARK MAX Motor Controller
es_mx: Controlador de motor SPARK MAX

source: The `SPARK MAX Motor Controller <https://www.revrobotics.com/rev-11-2158/>`__ from REV Robotics has advanced brushed and brushless DC motor control including the REV Robotics NEO Brushless Motor. The SPARK MAX can be controlled over PWM, CAN or USB (for configuration/testing only).
es_mx: El `Controlador de Motor SPARK MAX <https://www.revrobotics.com/rev-11-2158/>`__ de REV Robotics cuenta con control avanzado de motores con o sin escobillas, incluido el motor sin escobillas NEO de REV Robotics. El SPARK MAX puede ser controlado a través de PWM, CAN o USB (solo para configuración/pruebas).

source: TalonFX Motor Controller
es_mx: Controlador de motor TalonFX

source: The `TalonFX Motor Controller <http://www.ctr-electronics.com/talon-fx.html>`__ is integrated into the Falcon 500 brushless motor. It features an integrated encoder and all of the smart features of the Talon SRX and more! For more information see the `Falcon 500 User Guide <http://www.ctr-electronics.com/downloads/pdf/Falcon%20500%20User%20Guide.pdf>`__.
es_mx: El `Controlador de Motor TalonFX <http://www.ctr-electronics.com/talon-fx.html>`__ está integrado en el motor sin escobillas Falcon 500. Cuenta con un encoder integrado y todas las funciones inteligentes del Talon SRX y más! Para más información vea el `Falcon 500 User Guide <http://www.ctr-electronics.com/downloads/pdf/Falcon%20500%20User%20Guide.pdf>`__.

source: SPARK Motor Controller
es_mx: Controlador de motor SPARK

source: The `SPARK Motor Controller <https://www.revrobotics.com/rev-11-1200/>`__ from REV Robotics is an inexpensive brushed DC motor controller. The SPARK is controlled using the PWM interface. Limit switches may be wired directly to the SPARK to limit motor travel in one or both directions.
es_mx: El `Controlador de Motor SPARK <https://www.revrobotics.com/rev-11-1200/>`__ de REV Robotics es un controlador de motores de corriente continua con escobillas económico. El SPARK es controlado usando la interfaz PWM. Se puede conectar limit switches directamente al SPARK para limitar el movimiento de un motor en una o ambas direcciones.

source: Victor SP
es_mx: Víctor SP

source: The `Victor SP Motor Controller <https://www.ctr-electronics.com/downloads/pdf/Victor-SP-Quick-Start-Guide.pdf>`__ is a PWM motor controller from Cross The Road Electronics/VEX Robotics. The Victor SP has an electrically isolated metal housing for heat dissipation, making the use of the fan optional. The case is sealed to prevent debris from entering the controller. The controller is approximately half the size of previous models.
es_mx: El `Controlador de Motor Victor SP <https://www.ctr-electronics.com/downloads/pdf/Victor-SP-Quick-Start-Guide.pdf>`__ es un controlador de motor PWM de Cross The Road Electronics/VEX Robotics. El Victor SP cuenta con una carcasa metálica aislada eléctricamente para disipar el calor, haciendo el uso de un ventilador opcional. La carcasa está sellada para prevenir la entrada de residuos en el controlador. El controlador es de aproximadamente la mitad de tamaño de los modelos previos.

source: Talon Motor Controller
es_mx: Controlador de motor Talon

source: The `Talon Motor Controller <https://ctr-electronics.com/Talon_User_Manual_1_1.pdf>`__ from Cross the Road Electronics is a PWM controlled brushed DC motor controller with passive cooling.
es_mx: El `Controlador de Motor Talon <https://ctr-electronics.com/Talon_User_Manual_1_1.pdf>`__ de Cross the Road Electronics es un controlador de motores de corriente continua con escobillas PWM con enfriamiento pasivo.

source: Victor 888 Motor Controller / Victor 884 Motor Controller
es_mx: Controlador de motor Victor 888 / Controlador de motor Victor 884

source: The `Victor 884 <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__ and `Victor 888 <https://content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__ motor controllers from VEX Robotics are variable speed PWM motor controllers for use in FRC. The Victor 888 replaces the Victor 884, which is also usable in FRC.
es_mx: Los controladores de motor `Victor 884 <https://content.vexrobotics.com/docs/ifi-v884-users-manual-9-25-06.pdf>`__ y `Victor 888 <https://content.vexrobotics.com/docs/217-2769-Victor888UserManual.pdf>`__ son controladores PWM de velocidad variable de VEX Robotics para ser usados en FRC. El Victor 888 reemplaza al Victor 884 que también era utilizable en FRC.

source: Jaguar Motor Controller
es_mx: Controlador de motor Jaguar

source: DMC-60 and DMC-60C Motor Controller
es_mx: Controlador de motor DMC-60 y DMC-60C

source: The DMC-60 is a PWM motor controller from Digilent. The DMC-60 features integrated thermal sensing and protection including current-foldback to prevent overheating and damage, and four multi-color LEDs to indicate speed, direction, and status for easier debugging. For more information, see the `DMC-60 reference manual <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__
es_mx: El DMC-60 es un controlador de motor PWM de Digilent. El DMC-60 cuenta con detección y protección térmicas integradas que incluyen retroceso de corriente para evitar el sobrecalentamiento y daños, y cuatro LED multicolores para indicar la velocidad, la dirección y el estado para facilitar la depuración. Para obtener más información, consulte el `Manual de referencia de DMC-60 <https://reference.digilentinc.com/_media/dmc-60/dmc60_rm.pdf>`__

source: Venom Motor Controller
es_mx: Controlador de motor de veneno

source: SD540B and SD540C Motor Controllers
es_mx: Controladores de motor SD540B y SD540C

source: The Spike H-Bridge Relay from VEX Robotics is a device used for controlling power to motors or other custom robot electronics. When connected to a motor, the Spike provides On/Off control in both the forward and reverse directions. The Spike outputs are independently controlled so it can also be used to provide power to up to 2 custom electronic circuits. The Spike H-Bridge Relay should be connected to a relay output of the roboRIO and powered from the Power Distribution Panel. For more information, see the `Spike User’s Guide <https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>`__.
es_mx: El Spike H-Bridge Relay de VEX Robotics es un dispositivo que se utiliza para controlar la energía de los motores u otros dispositivos electrónicos de robot personalizados. Cuando se conecta a un motor, el Spike proporciona control de encendido/apagado en ambas direcciones hacia adelante y hacia atrás. Las salidas de Spike se controlan de forma independiente, por lo que también se pueden utilizar para proporcionar energía a hasta 2 circuitos electrónicos personalizados. El Spike H-Bridge Relay debe conectarse a una salida de relé del roboRIO y alimentarse desde el panel de distribución de energía. Para obtener más información, consulte la `Guía del usuario de Spike <https://content.vexrobotics.com/docs/spike-blue-guide-sep05.pdf>` __.

source: The Servo Power Module from Rev Robotics is capable of expanding the power available to servos beyond what the roboRIO integrated power supply is capable of. The Servo Power Module provides up to 90W of 6V power across 6 channels. All control signals are passed through directly from the roboRIO. For more information, see the `Servo Power Module webpage <https://www.revrobotics.com/rev-11-1144/>`__.
es_mx: El Servo Power Module de Rev Robotics es capaz de expandir la potencia disponible para los servos más allá de lo que es capaz de hacer la fuente de alimentación integrada roboRIO. El módulo de alimentación servo proporciona hasta 90 W de potencia de 6 V en 6 canales. Todas las señales de control se transmiten directamente desde roboRIO. Para obtener más información, consulte la página web del Servo Power Module <https://www.revrobotics.com/rev-11-1144/> `__.

source: Axis M1013/M1011/206 Ethernet Camera
es_mx: Cámara Ethernet Axis M1013 / M1011 / 206

source: The Axis M1013, M1011 and Axis 206 Ethernet cameras are used for capturing images for vision processing and/or sending video back to the Driver Station laptop. The camera should be wired to a 5V power output on the Voltage Regulator Module and an open ethernet port on the robot radio. For more information, see :ref:`Configuring an Axis Camera <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>` and the `Axis 206 <https://www.axis.com/en-us/products/axis-206>`__, `Axis M1011 <https://www.axis.com/en-us/products/axis-m1011>`__, `Axis M1013 pages <https://www.axis.com/en-us/products/axis-m1013>`__.
es_mx: Las cámaras ethernet Axis M1013, M1011 y Axis 206 son usadas para capturar imagen para procesamiento de visión y/o enviar un video de regreso a la laptop de la Driver Station. La cámara debe conectarse a una salida de 5V en el Voltage Regulator Module y a un puerto Ethernet disponible en el radio del robot. Para más información , vea :ref:`Configurar una ámara Axis <docs/software/vision-processing/axis-camera/configuring-an-axis-camera:Configuring an Axis Camera>` y las páginas de `Axis 206 <https://www.axis.com/en-us/products/axis-206>`__, `Axis M1011 <https://www.axis.com/en-us/products/axis-m1011>`__, `Axis M1013 <https://www.axis.com/en-us/products/axis-m1013>`__.
